{"data":{"site":{"siteMetadata":{"title":"James Ford","description":"James Ford's Portfolio"}},"allMarkdownRemark":{"edges":[{"node":{"id":"da0f6271-2dc5-5eaf-94d5-4d224b8bfafd","excerpt":"...","frontmatter":{"date":null,"path":"projects/pokeproject","title":"PokéProject"}}},{"node":{"id":"03753ae7-3986-53b3-b793-915b877cef35","excerpt":"...","frontmatter":{"date":null,"path":"projects/runmaps","title":"RunMaps"}}},{"node":{"id":"8f0029e0-68b6-5a75-b247-ebeb5d50148d","excerpt":"React helps encapsulate Front End tech into components, but how do you go about sharing those components across your organisation - for everyone to use, as easily as they would open-source components? In this talk I’m going to speak about how we…","frontmatter":{"date":null,"path":"speaking/sharing-code-with-200-engineers","title":"Sharing code with 200 Engineers"}}},{"node":{"id":"1a23f708-627a-505d-8b5e-cf0dae63f663","excerpt":"Open Source is a great idea for benefitting from the publicly available shared efforts of others, but what about sharing private code within your organisation? We call this \"Inner Source\", and we have a strategy and mentality (our \"Ecosystem\") that…","frontmatter":{"date":null,"path":"speaking/inner-source-ecosystems","title":"Inner Source Ecosystems"}}},{"node":{"id":"25949dbf-77c1-56a4-99dd-93932fb231bf","excerpt":"Software development is challenging, and cognitive overload is an enemy of productivity. We software developers probably spend more time in our IDE than we'd like to admit. We have the skills and ability to make our own lives better through…","frontmatter":{"date":null,"path":"speaking/make-your-tools-work","title":"Make Your Tools Work"}}},{"node":{"id":"cf539ae6-e58f-5f76-a2f1-e8063f333def","excerpt":"Delivering Javascript at scale. How do we deal with millions of page views a day and complex data sets. What challenges have we faced and the things they've learned whilst developing an application with lots of developers, for millions of end users.","frontmatter":{"date":null,"path":"speaking/delivering-js-at-scale","title":"Delivering JS at Scale"}}},{"node":{"id":"1e6fa970-422a-5560-84ed-af83ae3379b9","excerpt":"Think want to use TypeScript, but for one reason or another you’re not ready to make the leap into using .ts files? What is TypeScript anyway? How could it help us make better code or change our development experience? How exactly is it different…","frontmatter":{"date":null,"path":"speaking/guerilla-typescript","title":"Guerilla TypeScript"}}},{"node":{"id":"4612bd3e-8094-5dd0-aa10-895024c6c7d7","excerpt":"Strange as it may seem this isn’t something that’s obvious to figure out, so allow me to save you half an hour of searching and just give you the answer.Photo by rawpixel on UnsplashBackgroundAt the office we have a range of virtual and physical…","frontmatter":{"date":"February 13, 2019","path":"/blog/checking-availability-in-office-365/","title":"Checking Availability in Office 365"}}},{"node":{"id":"8ab1053e-6f9d-54ab-ad1d-b47815eea078","excerpt":"Inspired by Open Source.Inner-sourcing at Compare the Market.[Go to the profile of James FordJames FordBlockedUnblockFollowFollowingFeb 5The Open Source community is an inspiration for us at ComparetheMarket — how it operates, the quality of their…","frontmatter":{"date":"February 05, 2019","path":"/blog/inspired-by-open-source/","title":"Inspired by Open Source."}}},{"node":{"id":"0aae0502-49ea-52fa-abb7-b12e7f054315","excerpt":"Being recognised and rewarded for your efforts in the workplace is important, as is taking the time to recognise and reward others. Taking the time to deliver a direct, verbal expression of gratitude can mean a lot to its recipient, but adding a…","frontmatter":{"date":"December 04, 2018","path":"/blog/recognition-and-rewards/","title":"Recognition and Rewards"}}},{"node":{"id":"b38009f0-c0fd-50d2-acaa-09a7a6d405f5","excerpt":"Photo by Bernard Hermant on UnsplashA shared set of components is a great idea, so long as using those components doesn’t bloat your client applications. This is a brief tale of how we got it wrong, what the cause of our issues was, and how we fixed…","frontmatter":{"date":"November 06, 2018","path":"/blog/putting-our-component-library-on-a-diet-88aee7f457a/","title":"Putting our Component library on a diet."}}},{"node":{"id":"cb9198b0-bdf6-5c21-8199-ab6ad1e93061","excerpt":"Coding is complicated — there are loads of best practices to remember, guidelines to follow and ‘known issues’ to avoid — so it helps to have a ‘helping hand’ while you work.ESLint — https://eslint.org/ESLint - Pluggable JavaScript linterA pluggable…","frontmatter":{"date":"October 18, 2018","path":"/blog/eslint-visual-studio-code-editor-integration-for-the-win/","title":"ESLint + Visual Studio Code: Editor integration For The Win"}}},{"node":{"id":"b4d9a644-83b7-5506-ae41-fb694a301bbe","excerpt":"I find colours fascinating, and I write code that goes into websites, so there’s bound to be a natural intersection between those two subjects.At Compare the Market we’ve kicked off a new round of Lightning Talks: internal speaking opportunities for…","frontmatter":{"date":"September 24, 2018","path":"/blog/colours-a-lightning-talk/","title":"Colours: A lightning Talk ⚡️"}}},{"node":{"id":"a8952e40-9a54-5990-a026-2ddc942f8181","excerpt":"Photo by Rock’n Roll Monkey on UnsplashBackgroundAs a by-product of my day-to-day software development work I have created a lot of specific-task automation scripts. If there’s a task that I need to perform on a fairly regular basis that involves…","frontmatter":{"date":"August 13, 2018","path":"/blog/building-a-humanised-command-line-interface-with-node-js/","title":"Building a humanised command-line interface with Node.js"}}},{"node":{"id":"6eff6dd1-5c2e-5e38-9285-2e58924af2eb","excerpt":"Then & NowThe web isn’t what it used to be. Back when I started my career there used to be far more independent, personal, technical blogs, and far more content being created on them and traffic going directly to them. It was the only kind of…","frontmatter":{"date":"July 29, 2018","path":"/blog/rethinking-my-personal-website/","title":"Rethinking my “personal” website."}}},{"node":{"id":"ef248347-379c-50d0-80ac-40f335d2f034","excerpt":"I’ve recently worked with the team behind the Derby University website [https://www.derby.ac.uk/] and one of the details that I really like about the implementation of the design is that it features more than just fluid widths, it also features fluid…","frontmatter":{"date":"July 11, 2018","path":"/blog/fluid-widths-in-responsive-websites/","title":"Fluid widths in responsive websites."}}},{"node":{"id":"a7575e19-e14f-5828-9f39-6ff4f249339f","excerpt":"Talk #2 from the Agile Peterborough Meetup, 23rd January 2018\"Swearing, Nudity and other Vulnerable positions\" by John Le Drew, @antz29www.agilepath.fm / www.wisenoodles.comSafetySafety is a difficult concept to understand without the correct…","frontmatter":{"date":"June 08, 2018","path":"/blog/the-importance-of-psychological-safety-in-a-team/","title":"[The importance of] Psychological Safety in a team"}}},{"node":{"id":"81f8dd68-0f00-5adb-9220-72f644027ac7","excerpt":"RunMaps #4: Apply UI Sprinkles & Go Live!With all this effort spent building RunMaps, wouldn’t it be a shame to not share it with the world?For all its flaws, I’m happy to say that my first version of RunMaps is online for the world to see at https…","frontmatter":{"date":"June 08, 2018","path":"/blog/runmaps-4-apply-ui-sprinkles-go-live/","title":"RunMaps #4: Apply UI Sprinkles & Go Live!"}}},{"node":{"id":"8c0e85db-6596-514c-908b-9c2bfa44d54b","excerpt":"In my previous posts I’ve discussed the initial development of my RunMaps side-project and the subsequent switch over to using Overpass API instead of the initial Mapbox APIs. Now it’s time to pick up where we left the original development; improving…","frontmatter":{"date":"May 26, 2018","path":"/blog/runmaps-3-colour-schemes-and-labels/","title":"RunMaps 3: Colour Schemes and Labels"}}},{"node":{"id":"c0cd1d8b-a44f-556b-822d-41beeffcaaa6","excerpt":"In my previous post, ‘Generating Run Maps with Node.js’, I talked through the winding path that eventually led me to a place where I’d hooked up data from my activities on Fitbit with data from the Mapbox APIs and created a scalable vector image…","frontmatter":{"date":"May 26, 2018","path":"/blog/runmaps-v2-0-breaking-free-of-mapbox/","title":"RunMaps v2.0: Breaking free of Mapbox"}}},{"node":{"id":"e090db7d-fd3b-5a23-9d57-a06db6b8f917","excerpt":"Yes, it’s a project from Hell, but who’s to blame?This tale of a project from hell (from Twitter, above, direct link to the original article) got me thinking this past week.On the surface there’s the pure technical story, the gory details of a…","frontmatter":{"date":"March 29, 2018","path":"/blog/culture-of-fear/","title":"Culture of fear"}}},{"node":{"id":"2735ec92-7b2e-527e-90dd-ba4f872c3c63","excerpt":"These are my notes from talk #1 from the Agile Peterborough Meetup on the 23rd January 2018.Delivered by Alex Ellis, founder and lead dev of OpenFaaS, and Docker Captain.evolutionFunctions are the evolution of microservices. They do one thing, really…","frontmatter":{"date":"March 26, 2018","path":"/blog/openfaas-like-lamba-but-open/","title":"OpenFaaS: Like AWS Lambda, but Open Source and built on top of Docker"}}},{"node":{"id":"a73cf840-629d-5afe-9528-720f1d223320","excerpt":"Hacking away at the Mapbox and Fitbit data APIsThe big idea 💡I joined Deeson as a remote worker about six months ago, and to accompany this change in lifestyle I decided to take up running. Fast-forward a couple of months and I’ve signed myself up…","frontmatter":{"date":"March 26, 2018","path":"/blog/generating-run-maps-with-node-js/","title":"Generating Run Maps with Node.js"}}},{"node":{"id":"70c800b6-04c2-5e10-8744-bc40e7e75b4d","excerpt":"Refactoring and enhancing an MVPIf there’s one thing I’ve learnt from successful projects over the past few years it’s the value of identifying and building the Minimum Viable Product (MVP) and then enhancing it post-release.Keeping the project scope…","frontmatter":{"date":"March 20, 2018","path":"/blog/duotone-version-2/","title":"Duotone: Version 2"}}},{"node":{"id":"67c8c293-7862-53f8-b7ba-0b0d13fcf875","excerpt":"Applying filters to images and generating downloads with client-side JavascriptIt all started with ^ this Tweet. ^Whist stumbling through my reading list I was impressed by the image filtering capabilities of the humble SVG, as demonstrated by Lentie…","frontmatter":{"date":"March 13, 2018","path":"/blog/building-duotone/","title":"Building “duotone”"}}},{"node":{"id":"93270839-75f4-5ff6-88ba-b9644110a116","excerpt":"Here’s my next big idea.Most products seem to be an idea that you can knock up a prototype for in three hours, if you know what you’re doing.Even if you don’t know what you’re doing you can learn an awful lot about a subject in that space of time.My…","frontmatter":{"date":"March 11, 2018","path":"/blog/3-hour-hacks/","title":"3 hour hacks"}}},{"node":{"id":"e87feaf3-96d0-5b47-9583-dab6fe7a45df","excerpt":"A while ago now, I set out on a side project adventure, which I’ve previously documented in Part 1, Part 2 and Part 3. Finally though it’s time to make the leap into the real world and “eat my own dog food,” so to speak.For my first real world…","frontmatter":{"date":"October 04, 2017","path":"/blog/poképroject-adventures-with-lego-bricks-5ffefc875a8f/","title":"PokéProject: Adventures with LEGO Bricks"}}},{"node":{"id":"c739bc2c-6ec6-5029-a8ad-9baaf278eccb","excerpt":"Some concepts transcend time and technology specifics. To make it easier to get yourself up to date with these ideas, I'm going to list my favourite articles, links and publications on a single page.Development ManagementArticle: How terrible code…","frontmatter":{"date":"September 30, 2017","path":"/blog/thought-leadership/","title":"Thought Leadership"}}},{"node":{"id":"140d670f-cf79-5e44-b74f-5b4b34ff44ea","excerpt":"Christian Maioli Mackeprang has written an article which you can find here and here about at least some of the origins of bad code - almost all of which I would say is true. You can head over to the original article to read it in full, but the key…","frontmatter":{"date":"September 30, 2017","path":"/blog/how-terrible-code-gets-written-by/","title":"Link: “How terrible code gets written by perfectly sane people”"}}},{"node":{"id":"0919ef56-dd4c-5c3a-b6bf-81da9bffe9f9","excerpt":"A remarkable number of excellent books about Front End Web Development are freely available online, if you know where to look. Here's a collection of those that I've discovered, and deigned to keep in my bookmarks.Eloquent JavaScript:http…","frontmatter":{"date":"September 25, 2017","path":"/blog/front-end-web-development-books/","title":"A collection of free, online, Front End Web Development books."}}},{"node":{"id":"9334a06c-0a30-590b-bfc2-8d198ae2b67f","excerpt":"Background: I've been using Visual Studio Code for about half a year now, after giving it a try at the insistence of other developers at the office. Prior to this I used Jetbrains WebStorm and PHPStorm.The verdict: My experience so far has been…","frontmatter":{"date":"September 24, 2017","path":"/blog/my-visual-studio-code-setup/","title":"My Front End Web Development setup, with Visual Studio Code."}}},{"node":{"id":"b0618b35-063a-5426-adc8-ebdbeaaa38d9","excerpt":"PokéProject: LEGO Edition started with colour mapping and developed into a calculation of optimal brick placement, and now I’m planning to put some money on the line and actually purchase some bricks and make this project into a tangible reality…","frontmatter":{"date":"June 07, 2017","path":"/blog/poképroject-adventures-with-lego-bricks-c7b9b8385276/","title":"PokéProject: Adventures with LEGO Bricks"}}},{"node":{"id":"3d2607b1-ec19-5801-b7a6-5b88fc41163f","excerpt":"By this point I’ve already mapped my colour palette of my source image to the available LEGO brick colours as described in my previous post, and now I want to move beyond simple colour trickery and onto making this idea a physical reality.Optimal…","frontmatter":{"date":"June 07, 2017","path":"/blog/poképroject-adventures-with-lego-bricks-cd9401091239/","title":"PokéProject: Adventures with LEGO Bricks"}}},{"node":{"id":"23304fb5-fe14-5507-b54c-c4b59cdd1c4c","excerpt":"From image sprite to pixel art.What’s the difference between the image sprites included in the original Game Boy games and Retro Pixel art? If you ask me, it’s just a matter of scale — scale the images up, and suddenly it’s art.Art, for reference.But…","frontmatter":{"date":"June 05, 2017","path":"/blog/poképroject-adventures-with-lego-bricks-7f24c02f6d9d/","title":"PokéProject: Adventures with LEGO Bricks"}}},{"node":{"id":"98dd0436-0dba-5784-b43a-6ef7252160e4","excerpt":"Trello is one of my favourite low-budget Content Management Systems for bootstrapped projects (that is to say, projects with zero budget and not projects which use the bootstrap css framework.)One of the more recent things I've had to do is upload…","frontmatter":{"date":"May 18, 2017","path":"/blog/uploading-files-to-trello-with-node-js/","title":"Uploading files to Trello with Node.js"}}},{"node":{"id":"ad23239c-5d1d-512f-bacc-2b0f430380ed","excerpt":"SummaryWith a clever bit of trickery from HTML5 and JavaScript, it is possible to trigger a browser download of anything that can be generated in a canvas element, regardless of whether that element is visible or not. This works in modern browsers…","frontmatter":{"date":"May 01, 2017","path":"/blog/generating-images-for-download-with-html5-and-canvas/","title":"Generating images for download with HTML5 and Canvas"}}},{"node":{"id":"4a134923-1b8e-5aac-8e94-052724e916fe","excerpt":"Image from Unsplash / Adam BirkettHow to effectively kill your Agile TeamAgile methodology is the glorious present and future of software development, but the correct set of circumstances can seriously cripple a team’s morale and their effectiveness…","frontmatter":{"date":"April 26, 2017","path":"/blog/how-to-effectively-kill-your-agile-team/","title":"How to effectively kill your Agile Team"}}},{"node":{"id":"6270b7d4-7b7a-57d7-b12e-0264539473da","excerpt":"Preface:This is the story of my development journey with PokéProject. Hopefully this isn't the complete story, and there's much more to be told again in the future. This isn't a tale of the perfect development lifecycle, and I'm sure that if I…","frontmatter":{"date":"April 10, 2017","path":"/blog/from-static-html-to-react-to-nuxt/","title":"PokéProject: from Static HTML, to React, to Nuxt."}}},{"node":{"id":"1abf86c6-e2d1-5873-8a1a-79770eaf6e81","excerpt":"PokéProject: from Static HTML, to React, to Nuxt.This is the story of my development journey with PokéProject. Hopefully this isn’t the complete story, and there’s much more to be told again in the future. This isn’t a tale of the perfect development…","frontmatter":{"date":"April 10, 2017","path":"/blog/poképroject-from-static-html-to-react-to-nuxt/","title":"PokéProject: from Static HTML, to React, to Nuxt."}}},{"node":{"id":"86f5b66a-b42f-5308-8c92-8149320076ab","excerpt":"Image Credit: Unsplash / Amador LoureiroI like writing. That’s not always been the case — it certainly wasn’t my forte back when I needed it at school and with my University dissertation (as my wife will testify) but it’s something I’ve picked up…","frontmatter":{"date":"February 19, 2017","path":"/blog/overcoming-writers-block/","title":"Overcoming writer’s block"}}},{"node":{"id":"9f271865-4002-50cb-a54d-88b8e20f5cdd","excerpt":"Hallmarks of a Modern development workflow — Continuous Integration & DeploymentSoftware Development is a creative process, and as such it’s important to minimise the things which can disrupt your flow.A modern web development setup is one that…","frontmatter":{"date":"January 30, 2017","path":"/blog/hallmarks-of-a-modern-development-workflow-continuous-integration-deployment-811b2545be39/","title":"Hallmarks of a Modern development workflow — Continuous Integration & Deployment"}}},{"node":{"id":"f7b7b2b0-8289-573a-bd38-0a103b523ca4","excerpt":"Testing Performance, Speed and Best Practices with LighthouseLighthouse is an open-source, automated tool for improving the quality of your web apps.Web Development is an ever changing landscape, and as such we use a variety of tools to evaluate what…","frontmatter":{"date":"January 28, 2017","path":"/blog/testing-performance-speed-and-best-practices-with-lighthouse/","title":"Testing Performance, Speed and Best Practices with Lighthouse"}}},{"node":{"id":"5bf7c561-0ab7-5865-8c1c-ed285fc97f3f","excerpt":"Image from Unsplash / William IvenScribbling away during meetings.I’ve become quite keen on making what’s known as “sketch notes” during meetings and presentations. It’s something that I first encountered a little while ago when I met people at…","frontmatter":{"date":"January 24, 2017","path":"/blog/scribbling-away-during-meetings/","title":"Scribbling away during meetings."}}},{"node":{"id":"85e10d01-bee1-50ee-a5fe-a6d8108cf0ca","excerpt":"Modular Code Libraries FTWThanks to the fact that I work alongside a bunch of awesome people, today I’ve been introduced to the date-fns library, and it struck a chord with me because it the epitomises a way of thinking about creating manageable…","frontmatter":{"date":"January 12, 2017","path":"/blog/modular-code-libraries-ftw/","title":"Modular Code Libraries FTW"}}},{"node":{"id":"be764af8-cf27-5707-a27b-b7caa8ef75d5","excerpt":"Header image c/o Ilya Pavlov / UnsplashWhat to look for from a (prospective) DeveloperI’ve been doing a lot of interviews recently – at least one a month for a few months now – so I thought I would share a little more information about what I’m…","frontmatter":{"date":"January 10, 2017","path":"/blog/what-to-look-for-from-a-prospective-developer/","title":"What to look for from a (prospective) Developer"}}},{"node":{"id":"a19ee853-61cd-501b-a26a-196db59afc17","excerpt":"I can’t quite work out if Agile is a buzzword, a cult or some larger form of organised religion. I’m lost in a sea of ritualistic meetings and awash with stuff like #shipit and “Get Shit Done”.Build, Measure, Learn. Done is better than Perfect. Stop…","frontmatter":{"date":"January 04, 2017","path":"/blog/rituals-dogma-and-the-agile-manifesto/","title":"Rituals, dogma and the Agile Manifesto."}}},{"node":{"id":"a2ff6fb4-3f58-542a-93dc-8595ea898e7e","excerpt":"tldr;\nIf your Marketing strategy doesn't already involve an automaton or some other form of repetitive work slave (interns don't count) it really needs an upgrade.For an Improved Customer ExperienceMaintaining a customer base is easier when your…","frontmatter":{"date":"January 03, 2017","path":"/blog/why-your-next-marketing-hire-should-be-a-robot/","title":"Why your Next Marketing Hire should be a Robot."}}},{"node":{"id":"b99e778f-11c7-5f55-9918-b147b551235b","excerpt":"I am (currently) a fervent WebStorm IDE user. Many on our Front-End Team are also WebStorm users, others are Sublime Text users and one or two use Atom.Recently though, the strangest thing has happened - developers on the Front-End team and others…","frontmatter":{"date":"December 28, 2016","path":"/blog/is-it-time-to-use-visual-studio-code-as-your-ide/","title":"Is it time to use Visual Studio Code as your IDE?"}}},{"node":{"id":"51617211-d9ba-5e1b-a445-88eb3e143855","excerpt":"Image from Jason Rosewell / Unsplash / https://unsplash.com/photos/ASKeuOZqhYUI’m running this ‘Development Diary’ on roughly a week’s worth of lag now, and after yesterday’s disastrous server-upgrade failure I thought it was about time I stepped…","frontmatter":{"date":"October 06, 2016","path":"/blog/poképroject-dev-diary-day-seven/","title":"PokéProject Dev Diary: Day Seven"}}},{"node":{"id":"07d92ad4-6fe2-5bcd-a817-8620646e329f","excerpt":"Sometimes you wish you’d never started.Well, day six was a bit of a depressing development experience.What a depressing evening that was.To cut a long story short, I started out with the aim improving the SEO of PokéProject by upgrading the website…","frontmatter":{"date":"September 26, 2016","path":"/blog/poképroject-dev-diary-day-six/","title":"PokéProject Dev Diary: Day Six"}}},{"node":{"id":"34a38e99-4801-5301-ad32-a69ef2b017b2","excerpt":"Cover image by Alice Achterhof / Unsplash: https://unsplash.com/search/painting?photo=FwF_fKj5tBoPokéProject has been live for just over a day now, and I’ve had some initial feedback from early users.Amongst that feedback was updating the design to…","frontmatter":{"date":"September 20, 2016","path":"/blog/poképroject-dev-diary-day-five/","title":"PokéProject Dev Diary: Day Five"}}},{"node":{"id":"7c4ee5cc-9964-55a6-a96f-662928da754b","excerpt":"At this point, we’ve prototyped our idea, improved it visually, sorted out our own store of data, and now it’s time to — finally — go live.version 1.0 is now live!In the spirit of Agile, I’m not going to wait for every one of my crazy ideas to be…","frontmatter":{"date":"September 19, 2016","path":"/blog/poképroject-dev-diary-day-four/","title":"PokéProject Dev Diary: Day Four"}}},{"node":{"id":"5867a5c9-7823-52ed-b02e-0f2ddca50e0c","excerpt":"“Being as LEAN and AGILE as possible can be interpreted as being as-lazy-as-possible about your solutions for as-long-as they work, and that’s certainly the case so far with PokéProject.”But now it’s become apparent that the original “Google it, ctrl…","frontmatter":{"date":"September 17, 2016","path":"/blog/poképroject-dev-diary-day-three/","title":"PokéProject Dev Diary: Day Three"}}},{"node":{"id":"583882eb-22c5-5e3c-8ae2-c8a11b80f5e4","excerpt":"We have our inspiration, so now it’s time to throw a prototype together. I’m pacing the development of this project out in blocks of a few hours at a time, and usually in an evening.Fortunately I’ve done quite a few different projects before, and…","frontmatter":{"date":"September 11, 2016","path":"/blog/poképroject-dev-diary-day-one/","title":"PokéProject Dev Diary: Day One"}}},{"node":{"id":"61807108-0eb5-572a-936c-ca7ba122ef4f","excerpt":"Cover image from @MindJournal / Unsplash: https://unsplash.com/@mindjournalsI’ve written a little before about my exploits as I try to live in “a constant state of Hackathon” but this time I thought I’d change it up a bit and actually write about the…","frontmatter":{"date":"September 09, 2016","path":"/blog/poképroject-dev-diary-prologue/","title":"PokéProject Dev Diary: Prologue"}}},{"node":{"id":"c86a9ac3-900b-50e5-9456-db3d167d720c","excerpt":"On Thursday, Agile died.Last Thursday, the Agile in our project died. For most people around the world the day was unremarkable, but for us, on this particular Thursday, Agile was — finally — put out of its misery.A dramatic reconstruction of…","frontmatter":{"date":"May 25, 2016","path":"/blog/on-thursday-agile-died/","title":"On Thursday, Agile died."}}},{"node":{"id":"b5411ae3-9109-503a-91bf-f7d560a368b1","excerpt":"I’ve been making a lot of simple prototypes recently. Each one has at least one feature that is unique and uses a technology that is new to me, and each explores an idea that I’ve come up with myself.I’m pleased with my prototypes and the fact that I…","frontmatter":{"date":"May 17, 2016","path":"/blog/explorative-prototyping/","title":"Explorative Prototyping"}}},{"node":{"id":"f4366a7a-27af-54dc-a1fc-ea0e35248254","excerpt":"Project LOLBot or: How I Learned to Stop Worrying and Love My M.V.P.Title image (c) 2010 JonathunderIt’s recently been Hackathon time again at MMT Digital, which gave @ben_squire and myself (@psyked) a fantastic opportunity to work together on…","frontmatter":{"date":"April 05, 2015","path":"/blog/lolbot-or-how-i-learned-to-stop-worrying-and-love-my-mvp/","title":"LOLBot or: How I Learned to Stop Worrying and Love my MVP"}}},{"node":{"id":"88bee731-8daf-579e-a75d-36e7b151e46e","excerpt":"with New Relic InsightsIn the complicated world of software development there are many, many ways to achieve the same end result, and when those results are visually indistinguishable from one another we end up grasping for some solid (measurable…","frontmatter":{"date":"October 07, 2014","path":"/blog/amateur-data-spelunking","title":"Amateur data spelunking"}}},{"node":{"id":"8890eee9-c9fd-52c0-a91d-dcb68b6d325d","excerpt":"The 6 Deadly Sins of Unit TestingNot all of the traditional ‘7 deadly sins’ that we know and love apply to such abstract concepts as Unit Testing, but a fair few of them do apply and they plague us regularly in our efforts to create effective, useful…","frontmatter":{"date":"September 28, 2014","path":"/blog/the-6-deadly-sins-of-unit-testing/","title":"The 6 Deadly Sins of Unit Testing"}}},{"node":{"id":"1c366674-bb1a-5229-bb57-7132484f6089","excerpt":"Git Zero to Git HeroMastering git requires a mentor. Let me be yours.Getting started with gitIf reading is your thing, be sure to check out these ‘git basics’ guides. All of them cover the same content, but with a slightly different angle.Hello…","frontmatter":{"date":"September 14, 2014","path":"/blog/git-zero-to-git-hero/","title":"Git Zero to Git Hero"}}},{"node":{"id":"c0e4c6f5-f343-53ee-98da-777169bcc08c","excerpt":"If it’s not in Bitbucket,it doesn’t exist.Reinforcing Development Best Practiceswith brutally inflexible rules.A fly-on-the-wall at the MMT Digital offices might occasionally hear mutterings along the lines of;“If it’s not in Bitbucket, it doesn’t…","frontmatter":{"date":"September 14, 2014","path":"/blog/if-its-not-in-bitbucket-it-doesnt-exist/","title":"If it’s not in Bitbucket, it doesn’t exist."}}},{"node":{"id":"48ab26d3-2a27-5d09-8fbf-2195366f73aa","excerpt":"What is Git? What does it do, how does it work, how does it fit into my workflow?If you've ever wondered about the answers to any of those things, this session is designed for you, my friend.Starting with the assumption of no prior knowledge of Git…","frontmatter":{"date":"April 11, 2014","path":"/blog/git-101-force-sensitive-to-jedi-padawan/","title":"Git 101: Force-sensitive to Jedi padawan"}}},{"node":{"id":"93dfb2fc-2abf-5144-8421-c55107d744f5","excerpt":"A 10 minute ripping yarn through the world of responsive images.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n","frontmatter":{"date":"March 27, 2014","path":"/blog/responsive-images-in-10-minutes/","title":"Responsive Images in 10 minutes"}}},{"node":{"id":"4b24ebb6-e686-5330-8b38-34b9018c3e29","excerpt":"I'm amazed that I've never really used this before, but as well as using Git to manage your version history, you can also tap into built-in Git hooks to copy your project source code into another location after you've pushed your updates.Essentially…","frontmatter":{"date":"February 09, 2014","path":"/blog/using-git-hooks-for-project-deployment-wins/","title":"Using Git Hooks for Project Deployment wins"}}},{"node":{"id":"9a3c815a-0cb8-5cbd-9d50-db3b11223cd9","excerpt":"This is an excellent presentation, emphasising the need for, and benefits of, building Fast websites.","frontmatter":{"date":"January 29, 2014","path":"/blog/designing-for-performance/","title":"Designing for Performance"}}},{"node":{"id":"e45d1caa-d347-5b14-9897-5f5d66c1f4b4","excerpt":"Getting into GitHub, for fun, kudos and all that jazz.","frontmatter":{"date":"January 06, 2014","path":"/blog/fork-me/","title":"Fork me!"}}},{"node":{"id":"3df86f80-99a8-590b-a12d-97fa9a3bdf41","excerpt":"A brief talk introducing Grunt as a task management option for the development team.","frontmatter":{"date":"December 12, 2013","path":"/blog/grunt-an-introductory-training-deck/","title":"Grunt: An introductory training deck"}}},{"node":{"id":"c98de981-8ae3-57c3-bd9d-e351dc52ed82","excerpt":"Cross-browser JavaScript Unit Testing with Code Coverage","frontmatter":{"date":"October 02, 2013","path":"/blog/the-holy-grail-cross-browser-javascript-unit-testing-with-code-coverage-metrics/","title":"The Holy Grail: Cross-browser JavaScript Unit Testing with Code Coverage Metrics"}}},{"node":{"id":"11fce30e-8030-5ef0-8e43-165dcba483e7","excerpt":"Last week (8th May 2013, to be specific) we delivered a presentation at our local Agile business meetup - Agile on Tap. It all went well, and although I don't have a recording of the presentation (yet); I do have the slides to share, and here they…","frontmatter":{"date":"May 15, 2013","path":"/blog/our-presentation-from-agileontap/","title":"Our presentation from #AgileOnTap"}}},{"node":{"id":"226ef9ca-7d2f-5e4e-b684-00b6805e5204","excerpt":"For the last year or so I've been working on large scale (and complicated) Javascript applications, and one of the big deficiencies that exposed was the historically poor support for unit testable, metric-supported Javascript - at least within our…","frontmatter":{"date":"May 06, 2013","path":"/blog/javascript-testing-with-node-js-testacular-jasmine/","title":"Javascript Testing with Node.js, Testacular & Jasmine"}}},{"node":{"id":"57597cb6-4e19-54ee-84ee-73cb82fafdf9","excerpt":"Humans.txt is an interesting idea - it's (another) way for websites to create an association between the people (developers, authors, marketers, and so on) that are behind the creation of the website and the website itself, without actually including…","frontmatter":{"date":"November 22, 2011","path":"/blog/humans-txt/","title":"Humans TXT"}}},{"node":{"id":"5a3626a3-e5fb-5f4a-931e-8c27802c69b6","excerpt":"My FlashMidlands presentation has now taken place, and here's my slides, to share with the world:","frontmatter":{"date":"November 20, 2011","path":"/blog/the-slides-from-my-presentation-at-flashmidlands/","title":"The slides from my presentation at FlashMidlands."}}},{"node":{"id":"32dad9cd-baa2-5ea1-aee0-70687c3f49ca","excerpt":"On Saturday 19th November I'll be doing a session on the Flash Facebook Cookbook at the FlashMidlands meetup, and will have a copy or two of the book to give away.In the session I will be looking at working with the Facebook Graph API and Flash…","frontmatter":{"date":"November 15, 2011","path":"/blog/win-a-copy-of-the-flash-facebook-cookbook-at-my-flashmidlands-session-this-saturday/","title":"Win a copy of the Flash Facebook Cookbook, at my FlashMidlands session, this Saturday."}}},{"node":{"id":"5aece029-4f84-5fec-a1a9-8eb66634d626","excerpt":"While working with JSON-encoded data files, I had some problems getting the darn things to work.  Apart from an unhelpful error message, the Corona simulator gave me no clues as to what was wrong. Turned out that the problem was actually to do with…","frontmatter":{"date":"November 14, 2011","path":"/blog/corona-sdk-solving-json-decode-error-with-utf-8-files/","title":"Corona SDK: Solving JSON decode error with UTF-8 files."}}},{"node":{"id":"93fb021e-0ff8-53d4-92b2-c8a11d20bbd5","excerpt":"If you haven't encountered Nibbler before, Nibbler is a free-to-use website quality checker.  It's developed and maintained by Silktide, and is a tool for checking up to 5 pages of a website against 20 different quality checks - from Social Media to…","frontmatter":{"date":"November 14, 2011","path":"/blog/improving-your-website-with-nibbler/","title":"Improving your website with Nibbler"}}},{"node":{"id":"d5073c29-1bb0-5285-b7c7-9e7a2b1bdfdd","excerpt":"So, it turns out that the good old Facebook 'Like' buttons and Google's 'Plus one' buttons don't behave well on HTML5 format websites. That's because they make use of XHTML and namespaces. Sure, mixing XHTML and HTML5 together on a single page works…","frontmatter":{"date":"November 11, 2011","path":"/blog/hacking-facebook-like-buttons-for-w3c-validation-in-html5/","title":"Hacking Facebook \"Like\" buttons for W3C Validation in HTML5"}}},{"node":{"id":"2499eae0-a1ad-5b8a-8af0-4c634887ed08","excerpt":"Here's one of my highlights from Flash on the Beach 2011 - something that I'd never seen before, but blew me away with its coolness.HiSlope is a realtime video effects framework/library, which allows you to see and experiment with those effects in…","frontmatter":{"date":"September 15, 2011","path":"/blog/fotb2011-highlight-1/","title":"FOTB2011 Highlight #1: HiSlope"}}},{"node":{"id":"ec20933d-b6ca-50b1-a299-e82094dbfdd6","excerpt":"QuickB2 is a complete abstraction of Box2D, providing grouped hierarchies, extensible classes, and event-driven callbacks. The high-level interface enables developers to create physics simulations that are impractical to write using Box2D's API alone…","frontmatter":{"date":"September 11, 2011","path":"/blog/quickb2-box2d-for-flash-games/","title":"quickb2 - Box2D for Flash games."}}},{"node":{"id":"76ecce18-68a3-5893-838a-79048ff14030","excerpt":"It's official: my first book for Flash Platform developers is now finished and available to buy (or simply download); and it's called the \"Flash Facebook Cookbook\".The Flash Facebook CookbookIn the event that the title doesn't give it away, this is…","frontmatter":{"date":"September 04, 2011","path":"/blog/available-now-the-flash-facebook-cookbook/","title":"Available now: The Flash Facebook Cookbook"}}},{"node":{"id":"2ce9aa30-0281-5db5-ae36-70022569cf9a","excerpt":"Project Sprouts (http://projectsprouts.org/) is something that I'm just starting to get into, following much encouragement from Mark, and a cool presentation from Simon Bailey (http://www.newtriks.com/?tag=project-sprouts).What is Project Sprouts…","frontmatter":{"date":"July 22, 2011","path":"/blog/discovering-project-sprouts/","title":"Discovering: Project Sprouts"}}},{"node":{"id":"69d22332-7641-5711-9ec2-ee377e87ae5b","excerpt":"So I was having some trouble with corrupted workspaces in Appcelerator Titanium. Every time I launched the application it would try opening this corrupt workspace, and now offer any options for selecting a different one.The solution? In the end, I…","frontmatter":{"date":"July 19, 2011","path":"/blog/having-trouble-with-workspaces-in-appcelerator-titanium/","title":"Having trouble with workspaces in Appcelerator Titanium?"}}},{"node":{"id":"a2ea8298-5092-594c-9ef5-9883020fbd30","excerpt":"A screenshot of the Google+ Image details panelThere are of course many cool things in Google+, but here's one that piqued my interest on the Geek-factor.When you upload images to Google+ it goes to the trouble of extracting the images' metadata and…","frontmatter":{"date":"July 17, 2011","path":"/blog/cool-stuff-in-google-image-details/","title":"Cool stuff in Google+ - Image details"}}},{"node":{"id":"4b576e40-2444-591c-8558-dd3db04288bf","excerpt":"I've been working with FQL - Facebooks' SQL-like syntax - and I wanted a way to nicely format FQL queries, just as its possible to format JSON data.For example, I wanted a query like this one:To look more like this one:Apparently, there's not much…","frontmatter":{"date":"June 14, 2011","path":"/blog/a-rather-crude-fql-syntax-pretty-printer/","title":"A (rather crude) FQL syntax pretty-printer."}}},{"node":{"id":"f0b62ad8-3140-544c-864a-bb3f55f09f19","excerpt":"I've been significantly less active on this blog recently, which is primarily down to the fact that, for most of the past year, in my evenings and weekends, I've been writing a Developers' Cookbook for Packt Publishing - The Flash Facebook Cookbook…","frontmatter":{"date":"June 10, 2011","path":"/blog/introducing-the-flash-facebook-cookbook/","title":"Introducing: The Flash Facebook Cookbook"}}},{"node":{"id":"d8757925-4bd2-5570-aca6-e099ea9eb5e2","excerpt":"Shottts is an AIR application developed for the BlackBerry Playbook Tablet, developed by Mark Starling, of http://markstar.co.uk fame.Shottts loads and displays a selection of the most recent updates from Dribbble, and displays them in a nice, touch…","frontmatter":{"date":"May 09, 2011","path":"/blog/shottts-dribbble-for-the-blackberry-playbook/","title":"Shottts - Dribbble for the BlackBerry Playbook"}}},{"node":{"id":"ae263272-da93-5397-9099-3800fd9e6191","excerpt":"I've been exploring the HTML5 Geolocation specification recently, and it's both fascinating and a little scary how accurate your browsers' Geolocation capabilities have become, especially if you're working on a machine with Wifi capabilities.Inspired…","frontmatter":{"date":"April 12, 2011","path":"/blog/experiments-with-html5-geolocation/","title":"Experiments with HTML5 Geolocation"}}},{"node":{"id":"5d5dc21d-cb04-5917-8507-b543ae6dd3ea","excerpt":"Snapshot from the 3D Scene and Face tracking demoI may be slow on the uptake here, but Mr.doob has some awesome HTML5 and Flash Player showcase pieces over at mrdoob.com(http://mrdoob.com/ \"Open \"mrdoob.com\" in a new window.\"). It's hard to pick a…","frontmatter":{"date":"March 28, 2011","path":"/blog/link-face-tracking-and-3d-scene/","title":"Link: Face-tracking and 3D Scene"}}},{"node":{"id":"147e3503-1b67-5dba-8c83-96a5c5476f1f","excerpt":"I'm always on the look out for new yardsticks to measure by code by, and here's another one that I've been introduced to recently. It's called the DOM Monster, and it's something that you can drag and drop into your browser bookmarks bar, and then…","frontmatter":{"date":"March 24, 2011","path":"/blog/the-dom-monster/","title":"The DOM Monster"}}},{"node":{"id":"1537abfb-6700-538b-9933-0d3ce7a797a5","excerpt":"Developer beware.  AVM1Movie content (running ActionScript 2 content inside ActionScript 3 movies) is a spiralling nexus of doom that will lead to your eventual insanity, if you persist in walking down that path.Seriously.  I'd love to catalogue the…","frontmatter":{"date":"November 22, 2010","path":"/blog/i-hate-using-avm1movie/","title":"I hate using AVM1Movie..."}}},{"node":{"id":"f0ed9ddb-1507-5968-8da8-272e40a96f47","excerpt":"xJSFL [http://www.xjsfl.com/] is a scripting library for extending the JSFL functionality of the Flash IDE. Its aim is to do for JSFL what the jQuery library did for Javascript which, by the way, was awesome.  Basically it extends the JSFL syntax to…","frontmatter":{"date":"August 27, 2010","path":"/blog/xjsfl-that-looks-pretty-cool/","title":"xJSFL - That looks pretty cool."}}},{"node":{"id":"e1d8a7a6-5e56-5baa-ad46-17b287829071","excerpt":"It's been a couple of years since I either started working on ImageSizer or it went public (I can't remember which) and development has stalled a bit - but now I feel it's time to get things back on track.  So here's the plan.ImageSizer, now…","frontmatter":{"date":"July 28, 2010","path":"/blog/imagesizer-and-beyond/","title":"ImageSizer -- and beyond(!)"}}},{"node":{"id":"921f18db-d713-5bd4-9524-bec66b4dff0a","excerpt":"Just a little demo I've been working on, following my previous post: http://www.psyked.co.uk/actionscript/starrequests-simple-box2d-flickr-mashup-sample.htm. I've basically updated the code a little and swapped out the rectangular Box2D objects for…","frontmatter":{"date":"July 01, 2010","path":"/blog/a-more-advanced-starrequests-simple-box2d-flickr-example/","title":"A more advanced StarRequests, Simple-Box2D & Flickr example."}}},{"node":{"id":"cc56dd84-39d4-5da8-8865-350d6b265573","excerpt":" This came up while converting a Flex 3 AIR project to a Flex 4 AIR project. Luckily, the solution is all in the publish settings. Uncheck the box which says 'Generate accessible SWF file' and the error will go away.  Simple!","frontmatter":{"date":"June 21, 2010","path":"/blog/fixed-mx-accessibilitylabelaccimpl-could-not-be-found/","title":"Fixed: mx.accessibility:LabelAccImpl could not be found."}}},{"node":{"id":"96ce1c45-afe1-5a92-accf-2ab76a097e12","excerpt":"Mark (of MarkStar.co.uk) has been working away on his pet project \"StarRequests\" for a little while now, so I thought I'd give it a whirl and see what he's come up with - and of course, what I could come up with off the back of it.  This is the…","frontmatter":{"date":"June 07, 2010","path":"/blog/starrequests-simple-box2d-flickr-mashup-sample/","title":"StarRequests, Simple-Box2D & Flickr - a example mashup."}}},{"node":{"id":"ff6bea7f-e50e-5e61-93ac-d10b67b74921","excerpt":"Those are the three books I have stacked on my desk, in accordance with my recent iPhone development news [link].  I've been reading them quite a lot over the last few days, so I thought I'd post my own opinionated summary of them.iPhone Application…","frontmatter":{"date":"May 26, 2010","path":"/blog/an-incomplete-review-of-books-on-iphone-development/","title":"An incomplete review of books on iPhone Development."}}},{"node":{"id":"19fe2c7b-6db6-5e28-a1e8-687afcc545ae","excerpt":"It's finally happened. My tithe to Apple has been paid, and my iPhone has arrived on my desk.I'm still an Flash Platform developer of course, this isn't a career change - it's a broadening of horizons.  I anticipate much cursing and headscratching is…","frontmatter":{"date":"May 25, 2010","path":"/blog/i-am-now-an-iphone-app-developer/","title":"I am now an iPhone app developer."}}},{"node":{"id":"1daba628-d991-5020-b987-7da27d75391c","excerpt":"I love this application, Icon Generator Pro.  It's simple, but sometimes that's a good thing in an application, means it has focus - if you're going to do something, do it properly - that's one of the benefits of AIR, it makes it simple to create…","frontmatter":{"date":"May 12, 2010","path":"/blog/link-icon-generator-pro/","title":"Link: Icon Generator Pro"}}},{"node":{"id":"4858046a-647b-57a9-96ca-d60bb56c2d33","excerpt":"One thing that computers should be doing for us is making things simpler, but inevitably it all seems to get more and more complex. One part of that is because we expect everything to do more, along with one thing doing... well, everything.So what we…","frontmatter":{"date":"April 29, 2010","path":"/blog/link-hiding-the-complexity-of-your-tasks-with-bespoke-solutions/","title":"Layers of simplicity: Hiding the complexity of your tasks with bespoke solutions."}}},{"node":{"id":"dda460c0-4f8d-55b5-a569-0d1d118fc9d1","excerpt":"This is something I've been waiting a while for!http://www.zaalabs.com/2010/04/introducing-zaail-40-image-format-support-for-flash/Alchemy is a technology which makes it possible to convert code libraries from other languages, such as C, into ABC…","frontmatter":{"date":"April 28, 2010","path":"/blog/link-introducing-zaail-40-image-format-support-for-flash/","title":"Link: Introducing ZaaIL – 40+ Image format support for Flash"}}},{"node":{"id":"0db78f8a-8283-5734-94e4-03426a6855f6","excerpt":"For all the buzz it's getting, you'd think HTML5 was an avalanche of new features crashing around the web.  Seems more like the first snow of the year - you know; the one everyone hopes will herald days off work and snowball fights, but then melts…","frontmatter":{"date":"April 14, 2010","path":"/blog/so-what-can-you-do-with-html5/","title":"So, what can you do with HTML5?"}}},{"node":{"id":"a0711ea0-c686-5454-9cf9-9ec02d9c388d","excerpt":"Here's another cool library for AIR applications.  It works for both Windows and Mac environments, and uses the NativeProcess access of AIR version 2 to tap into the built-in voice synthesis functionality of the operating system.  It's still in…","frontmatter":{"date":"April 09, 2010","path":"/blog/link-voice-synthesis-in-adobe-air-2-0/","title":"Link: Voice synthesis in Adobe AIR 2.0"}}},{"node":{"id":"0e4a62b7-81b5-5f00-a761-b10b65b8b92e","excerpt":"A bit specialist perhaps, and the need for such a tool might become redundant if the Flash Builder hype is to be believed, but I found this quite useful for speeding up the process of writing a value-object class in AS3.http://projects.stroep.nl…","frontmatter":{"date":"March 26, 2010","path":"/blog/link-value-object-class-generator-for-as3/","title":"Link: Value Object Class generator for ActionScript 3"}}},{"node":{"id":"8443c718-35e8-5dad-ae89-ae3c05640841","excerpt":"These filters aren't really going to visually blow your mind - I think they're a little more on the techie or specific-use side of things, but that being said, they are very clever & pretty unique so they deserve a mention!Image processing library…","frontmatter":{"date":"March 09, 2010","path":"/blog/link-advanced-image-filters-for-flash-player/","title":"Link: Advanced image filters for Flash Player"}}},{"node":{"id":"87471611-edd8-58f4-a796-c932e1742ab6","excerpt":"FlashSURF is an image recognition library for Flash, distinguishable from other projects like the QR code and face recognition libraries by the fact that it’s just too damn clever. It’s a full colour, high resolution image recognition library that…","frontmatter":{"date":"February 24, 2010","path":"/blog/link-flashsurf-complex-image-recognition-in-flash-player/","title":"Link: FlashSURF - complex image recognition in Flash Player"}}},{"node":{"id":"06978cab-8ddc-53ac-94df-31764583e746","excerpt":"Nothing wrong with Flex of course, but Mark's experiments got me thinking about using Bit-101's MinimalComps [google code] all over again.  What are they? Well, they're a set of simple components - Buttons, Checkboxes, basic containers - that are…","frontmatter":{"date":"February 23, 2010","path":"/blog/minimal-components-for-when-you-dont-feel-like-using-flex/","title":"Minimal components: For when you don't feel like using Flex."}}},{"node":{"id":"cc31d18f-4dce-5801-a81d-29679ca4d454","excerpt":"^ This time, that's an image - saves on the page rendering time!Another update on the Box2D classes I'm working on.  No new features, but some pretty cool expansions and improvements to the library object creation.If you check out the previous post…","frontmatter":{"date":"February 03, 2010","path":"/blog/simple-box2d-better-cleverer-more-optimised/","title":"Simple Box2D - Better, cleverer, more optimised."}}},{"node":{"id":"843e6b3f-02c6-5532-bf38-dd84340251e9","excerpt":"Arrgh! All of a sudden the AIR Update Framework stops working.  No explanation, no errors; nothing. Where you'd expect to see your update notification popping up, you get a window just like the one above - no content, just the default Flex blue…","frontmatter":{"date":"January 29, 2010","path":"/blog/fixed-air-update-framework-broken/","title":"Fixed: AIR update framework broken!"}}},{"node":{"id":"cf4c1638-7ad0-56bb-979e-7cc9498df07c","excerpt":"If you don't know what ORM is read the next paragraph, and it might help.  If you do, skip to the links below to learn a little more about how you can make ORM work with AIR and SQLite.ORM stands for Object Relational Mapping, in basic terms the…","frontmatter":{"date":"January 28, 2010","path":"/blog/link-working-with-sqlite-in-air-using-orm/","title":"Link: Working with SQLite in AIR, with the help of ORM"}}},{"node":{"id":"cba7c753-4ff2-5c1d-adcf-5b8a693e9b9c","excerpt":"So a little while ago, Halloween in fact, I threw together a demo of some face-detection stuff I'd been looking at. [Check out the original post here.]  We originally had the demo on the MMT Digital homepage, but recently that's been updated and my…","frontmatter":{"date":"January 22, 2010","path":"/blog/webcam-face-detection-demo-now-with-source/","title":"Webcam Face detection demo: Now with source!"}}},{"node":{"id":"9d8cc6b6-cf98-5659-9240-58e32d1ecdc1","excerpt":"[This is a very cool experiment - using a socket in AS3 to interface with Brain Computer Interface (BCI) hardware. Check it out at this url: http://seantheflexguy.com/blog/2009/12/30/neurosky-mindset-brain-computer-interface-actionscript-3-0-api/","frontmatter":{"date":"January 20, 2010","path":"/blog/link-computer-mind-control-with-actionscript-3-0/","title":"Link: Computer mind control with ActionScript 3.0"}}},{"node":{"id":"535d9bd7-3ab5-57d8-8945-52e9aba8d320","excerpt":" [kml_flashembed movie=\"http://uploads.psyked.co.uk/2010/01/CurvedShapeExample.swf\" height=\"280\" width=\"500\" /](The image above this text is actually the Flash movie, if you hadn't guessed.  Try using your mouse to interact.  If it's blank, then…","frontmatter":{"date":"January 13, 2010","path":"/blog/demo-source-simple-box2d-with-curved-edges/","title":"Demo & Source: Simple Box2D, with curved edges!"}}},{"node":{"id":"06cd79f0-a2a9-56f9-8fce-596616d302d6","excerpt":"I've been working on some classes to simplify Box2D for Actionscript developers (See previous post for a quick intro).  The latest update to these classes introduces couple of minor ideas, and one gosh-darned awesome idea, if I do say so myself.  Let…","frontmatter":{"date":"January 11, 2010","path":"/blog/simple-box2d-custom-polygon-creation/","title":"Simple Box2D - Custom Polygon creation."}}},{"node":{"id":"87b217e9-3cba-5f04-952c-68ec78654084","excerpt":"One of the downsides to the Box2DAS3 project - and probably one of the major hurdles to most Flash developers - is the fact that it's inherited a lot of the syntax from the C++ project that it's derived from.  Maybe it's just because we're used to it…","frontmatter":{"date":"January 08, 2010","path":"/blog/simplifying-box2das3/","title":"Simplifying Box2DAS3..."}}},{"node":{"id":"382ab574-5d01-5106-97db-0e932d229507","excerpt":"It's becoming something of a tradition now I guess, but once I've allocated that extra Christmas holiday time appropriately, I find I have that little bit of extra time to devote to trying something new.  This year, I thought I'd try rewriting (again…","frontmatter":{"date":"January 04, 2010","path":"/blog/the-results-of-my-annual-code-something-different-this-christmas-idea/","title":"The results of my annual \"code something different this Christmas\" idea."}}},{"node":{"id":"d3f95968-fd3d-5554-841d-96adc8f5a3aa","excerpt":"In a non-too-subtle way, I thought I'd drum up a bit more enthusiasm for this years' Christmas Game, by showing you a few of the solutions that people have come up with for the levels.Type 1: The Basic solution.[Oh yes, it works for the first level…","frontmatter":{"date":"December 23, 2009","path":"/blog/building-bridges-some-solutions/","title":"Building Bridges: Some solutions"}}},{"node":{"id":"a57b55b4-d621-5177-9ea7-70967dfe16dd","excerpt":"It's that time of year again - and after a week or so of furiously learning Box2D, we at MMT Digital have just released our seasonal Flash game into the wild.  The idea is all about building bridges across gaps in the terrain, using Box2D to simulate…","frontmatter":{"date":"December 18, 2009","path":"/blog/building-bridges-a-box2d-powered-seasonal-game/","title":"\"Building Bridges\", a Box2D - powered Seasonal Game"}}},{"node":{"id":"62ad4c6d-f2ba-59e2-ac95-bd7e8c414a2e","excerpt":"This is very intriguing - a range of TVs with iPlayer, YouTube and other snazzy web-based features is available in the UK.  Of course, the idea might be old hat to a lot of people, but I only get really interesting in things when I hear that the…","frontmatter":{"date":"December 10, 2009","path":"/blog/the-flash-platform-in-your-tv/","title":"The Flash Platform in your TV?"}}},{"node":{"id":"3a9b3765-8529-51f1-b0ab-0ee0874b0097","excerpt":"One of the great things about Flex Builder is that it's developed on top of the already existing Eclipse IDE, and is itself just one of many uses the Eclipse project is put to.  Which means that many of the things you may want to do in your projects…","frontmatter":{"date":"December 04, 2009","path":"/blog/automating-tasks-in-flex-builder-with-the-help-of-a-little-something-called-ant/","title":"Automating tasks in Flex Builder, with the help of a little something called 'ANT'."}}},{"node":{"id":"de5e1f11-3721-5ba8-a7f0-8210f1f12207","excerpt":"There's a clever little javascript library that allows you to write CSS specifically for Chrome, the iPhone, IE 8, etc. all in a single file.  What it does is manipulate the HTML document client-side to add additional classes to the page, based on…","frontmatter":{"date":"November 28, 2009","path":"/blog/targeting-multiple-browsers-with-css-and-some-javascript-trickery/","title":"Targeting multiple browsers with CSS... and some Javascript trickery."}}},{"node":{"id":"252d861b-f1d3-527a-a4fe-6b79d11c453e","excerpt":"If you get it right, drop shadow effects can really improve the appearance and clarity of text.  Mark sent me the starting code for this a little gem a while ago, but I've extended it to support Flexs' CSS Styles support, and have been playing with…","frontmatter":{"date":"November 09, 2009","path":"/blog/embossed-shadowed-text-in-flex/","title":"Embossed / Shadowed text in Flex"}}},{"node":{"id":"4a9f68db-bca4-5085-898c-cdb94fb8afcd","excerpt":"Hopefully I'll get a chance to cover each of these in more detail shortly, but there's a whole bunch of cool new Actionscript 3 projects that are floating around at the moment - here are some of my favourites that I'm trying to find enough time to…","frontmatter":{"date":"November 05, 2009","path":"/blog/cool-actionscript-projects-to-try-out-if-you-havent-already/","title":"Cool ActionScript projects to try out, if you haven't already..."}}},{"node":{"id":"f9b53061-217d-5a79-9b71-467d45060e64","excerpt":"... at MMT Digital.Here's a bit of Friday afternoon fun for you.  I was playing around with some Actionscript face detection libraries last night, combined them with a webcam, some dynamic overlays, and voila! Augmented Reality, and just in time for…","frontmatter":{"date":"October 23, 2009","path":"/blog/webcam-face-detection-spooky-goings-on/","title":"Webcam + face detection = Spooky goings on..."}}},{"node":{"id":"287c1fcd-1f9e-5e58-a071-753d8436c794","excerpt":"Wow.  Because I'm so lazy at actually blogging about things, at least two full versions of ImageSizer have come and gone since my last post, so this is going to be a round-up of all of the cool things that've been introduced to ImageSizer recently…","frontmatter":{"date":"October 16, 2009","path":"/blog/imagesizer-0-5-3-is-now-available/","title":"ImageSizer 0.5.3 is now available!"}}},{"node":{"id":"8f05aa30-603a-5e96-a707-d1cdfec1ce9a","excerpt":"Little nugget of discovery for today;If like me, you hate having to open a separate FTP program to upload projects to a remote server you can install an FTP plugin for Eclipse, aka Flex Builder.  It’s not easy as pie to configure and it’s not so good…","frontmatter":{"date":"October 14, 2009","path":"/blog/getting-ftp-access-in-flex-builder/","title":"Getting FTP access in Flex Builder..."}}},{"node":{"id":"3f370e47-cda4-53c0-8cdc-ce4731647511","excerpt":"The Flash Player is due to get built-in DRM, sometime soon.  Actually it seems odd that it's not already in there, but perhaps this means a little more flexibility in Flash video is on the way.  My initial thoughts on hearing about DRM are slightly…","frontmatter":{"date":"September 16, 2009","path":"/blog/flash-introduces-drm-to-its-online-video/","title":"Flash introduces DRM to its online video"}}},{"node":{"id":"bb932fa7-257c-59ec-8cf2-807eae639285","excerpt":"Here's a little snippet - rotating BitmapData (through 90 degrees) with Actionscript 3.The code above can rotate an images BitmapData, using a Matrix to transform the image when you draw the data.  It's only really designed to rotate the image in 9…","frontmatter":{"date":"September 15, 2009","path":"/blog/rotating-bitmapdata/","title":"Rotating BitmapData with Actionscript 3"}}},{"node":{"id":"a5a028cd-feaa-5a60-9efd-bc217d0bdbf7","excerpt":"OSMF (Open Source Media Framework) is a new Open Source project from Adobe, designed to make deploying complex video players in the Flash Platform a little bit easier.  Jodie O'Rourke did a presentation for FlashMidlands on \"Intro to OSMF\", and here…","frontmatter":{"date":"August 12, 2009","path":"/blog/an-overview-of-open-source-media-framework-aka-adobe-strobe/","title":"An overview of Open Source Media Framework (aka. Adobe Strobe)"}}},{"node":{"id":"2a6303b8-94ab-5f49-89d6-c9a16cb0365d","excerpt":"It's been a while since I've posted anything substantial, and in a sense this post isn't going to buck that trend!ImageSizer version 0.4.12.4 is available on the AIR Marketplace and via the automatic update framework. Much to my dismay ImageSizer…","frontmatter":{"date":"July 24, 2009","path":"/blog/imagesizer-updated-again/","title":"ImageSizer updated! (again)"}}},{"node":{"id":"38747872-019d-58cd-a1c3-0dd5effab2f5","excerpt":"Uploading images to services like TwitPic is actually as easy as sending a HTTP POST request, which means its also pretty darned simple to upload something from Flash Player 10 or AIR. This is an example for AIR, but doing something similar in Flash…","frontmatter":{"date":"July 05, 2009","path":"/blog/how-to-post-images-to-twitpic-with-actionscript/","title":"How to: Post images to TwitPic with Actionscript"}}},{"node":{"id":"ae5c31d9-5445-59a1-913d-c478c4899ced","excerpt":"In case you weren't aware, a lot of the stuff you can do in a website you can also do in the Flash Player.  Prime example: Google Analytics tracking.Now for a simple Flash movie, you'd traditionally host the Flash file in an external website, and add…","frontmatter":{"date":"June 24, 2009","path":"/blog/tracking-flash-flex-air-applications-with-google-analytics/","title":"Tracking Flash / Flex / AIR applications with Google Analytics"}}},{"node":{"id":"d293ab54-e3da-5f4b-acee-2207eae3e0a5","excerpt":"[This came up a while ago, but I thought I'd promote the link I found that solved my woes.]The situation: I'm trying to interact with a REST API, via Flex and AIR.  Now, I know that the HTTPService class exists in Flex to make it really quick and…","frontmatter":{"date":"June 21, 2009","path":"/blog/link-posting-xml-data-without-using-httpservice/","title":"Link: POSTing XML data, without using HTTPService"}}},{"node":{"id":"6d636741-8705-5d4f-87a4-ddde4189fbde","excerpt":"Screentweetr is my latest little side project; an AIR application for uploading desktop screenshots to twitter image services. You can download it now, from the AIR Marketplace.[So, what is Screentweetr?Screentweetr is an application built on AIR…","frontmatter":{"date":"June 19, 2009","path":"/blog/what-are-you-looking-at-introducing-screentweetr/","title":"What are you looking at? (Introducing Screentweetr)"}}},{"node":{"id":"75b31f5f-252b-5081-bc90-f2420c4441e1","excerpt":"Zeh Fernando has posted about Tweener - a bit of a roundup of the development and demise [of Tweeners' development] of Tweener.  In short, it's no longer being developed, but it still works and is still pretty awesome.  That doesn't do the post…","frontmatter":{"date":"June 18, 2009","path":"/blog/tweener-4-years-old-now/","title":"Tweener - 4 years old now(!)"}}},{"node":{"id":"8308d525-7396-5e47-92be-de777c99d1de","excerpt":"Peter deHaan has posted a cool example of the way things work in the new Flex 4 'Spark' framework;http://blog.flexexamples.com/2009/06/13/creating-a-fading-bitmap-fill-background-on-a-spark-panel-container-in-flex-4/The aim of the new Spark…","frontmatter":{"date":"June 15, 2009","path":"/blog/link-creating-a-snazzy-background-in-flex-4/","title":"Link: Creating a snazzy background in Flex 4"}}},{"node":{"id":"2e904b07-ea62-5608-bdc3-1dbfd12e0c51","excerpt":"You quickly learn in Actionscript 3 that tracing an objects' contents is not always that simple.  Commands such as trace(myObject); often yeild the highly infuriating [object Object] return, which tells you mostly nothing of what you actually wanted…","frontmatter":{"date":"June 15, 2009","path":"/blog/flex-quick-tip-printing-an-objects-contents/","title":"Flex Quick Tip: Printing an Objects' contents"}}},{"node":{"id":"3f390718-63f2-5b69-a917-2c9ac79d7a8b","excerpt":"Here's a cool trick for Adobe AIR - getting native system icons.  So, if you have x application associated with x filetype, you can show the same icon in AIR as you would see on your desktop.  I don't think it can get you the little preview windows…","frontmatter":{"date":"May 22, 2009","path":"/blog/link-rendering-native-system-icons-in-air/","title":"Link: Rendering native system icons in AIR"}}},{"node":{"id":"3588ba8f-0dfe-537e-99ca-84b7838f2d11","excerpt":"It's been quite a while coming, but a new version of ImageSizer is now available. Here's a little look at what's new...Optional custom chrome:Introduced as a part of our bid to follow 'application best practice', you can now enable or disable the…","frontmatter":{"date":"May 11, 2009","path":"/blog/imagesizer-version-049-released/","title":"ImageSizer version 0.4.9 released!"}}},{"node":{"id":"2992ea54-02ab-5336-aefb-4d78d17767cf","excerpt":"Flash Camp Birmingham is now open for registrations - it's on June 16th (2009), 12pm - 8pm.It's gonna be great, of course - is organised by the Flash Midlands user group, and is the first FlashCamp to take place in the UK outside of London.  Luckily…","frontmatter":{"date":"May 07, 2009","path":"/blog/flash-camp-birmingham/","title":"Flash Camp Birmingham"}}},{"node":{"id":"07599942-3945-5196-a915-2fea542dd41f","excerpt":"Here's a little something I've been working on recently - Print Screen support in AIR. It has to be AIR because only AIR allows you to access the OS clipboard, and only AIR seems to have access to the full keyboard. There's a few things I've looked…","frontmatter":{"date":"April 17, 2009","path":"/blog/print-screen-detection-in-air/","title":"Print Screen detection in AIR"}}},{"node":{"id":"dfe29ec8-72c8-504f-bfd9-2ca1cf5433a4","excerpt":"After seeing Andrew Shorten's presentation on Flex 4 (Gumbo) and Flash Catalyst at #FlashMidlands this weekend, I thought it would be a good time to post a few Flex 4 links and a few thoughts.Flex 4 is looking exciting - Flex is one helluva good tool…","frontmatter":{"date":"April 06, 2009","path":"/blog/talking-about-flex-gumbo-new-features/","title":"Talking about: Flex Gumbo - new features"}}},{"node":{"id":"4352660f-b810-54e6-a6c3-dd35faaffc21","excerpt":"This is a 'public service announcement'.  Basically, the ImageSizer feedback screen hasn't always been working.  If you've used it already to send your feedback, there's a good chance that the message wasn't delivered, regardless of the confirmation…","frontmatter":{"date":"March 29, 2009","path":"/blog/imagesizer-feedback-screen-fail/","title":"ImageSizer - feedback screen fail. :-/"}}},{"node":{"id":"eb3b172c-8ff8-558d-81f6-0f6b2f815ff1","excerpt":"[ImageSizer has been reviewed over at RefreshingApps.com. It's a pretty good review, so go check it out at: http://refreshingapps.com/showcase/app/imagesizer/. You can of course download ImageSizer from the Adobe AIR Marketplace, or via the install…","frontmatter":{"date":"March 20, 2009","path":"/blog/imagesizer-reviewed-on-refreshingappscom/","title":"ImageSizer reviewed on RefreshingApps.com"}}},{"node":{"id":"00cd9012-e8d9-5692-8c6f-d2a2bc5ac49a","excerpt":"Squiddler has done some really cool stuff on the Flash platform, most of his blog posts are worth reading but check out these ones specifically:Bumblebee: http://www.squidder.com/2008/11/14/bumblebee-the-easiest-path-from-excel-to-xml/ This AIR…","frontmatter":{"date":"March 16, 2009","path":"/blog/squiddler/","title":"Squiddler"}}},{"node":{"id":"b7a8ccfe-4be2-530a-a764-10d6777105c3","excerpt":"ASDoc is a command-line tool that you can use to create API language reference documentation as HTML pages from the classes in your Adobe® Flex® application. The Adobe Flex team uses the ASDoc tool to generate the Adobe Flex Language Reference. [From…","frontmatter":{"date":"March 16, 2009","path":"/blog/setting-up-asdoc-in-flex-builder/","title":"Setting up ASDoc in Flex Builder"}}},{"node":{"id":"942afdeb-3fec-5574-bce5-1e828c887eef","excerpt":"ImageSizer is now up to version 0.4.6.  If you're paying attention to the number of updates I've been putting up here, that's a noticable jump from the last update, so I guess it's time for a roundup of all of the features that have been introduced…","frontmatter":{"date":"March 15, 2009","path":"/blog/imagesizer-updated-and-now-with-a-crop-tool/","title":"ImageSizer updated, and now with a Crop tool."}}},{"node":{"id":"70d5100e-6faa-5529-b2a3-3f168b3ec2fa","excerpt":"I've been meaning to post about this for ages now, but I suppose it's better late than never...Doc? is an AIR application that centralizes all of the help documentation in Flash and Flex (and indeed other documentation, if you want) into a single…","frontmatter":{"date":"March 04, 2009","path":"/blog/viewing-flash-flex-air-documentation-offline-with-doc/","title":"Viewing Flash / Flex / AIR documentation offline with \"Doc?\""}}},{"node":{"id":"6e031530-6627-55a0-98b7-1dc19cd0bd66","excerpt":"http://blog.themeforest.net/tutorials/jquery-for-absolute-beginners-video-series/These look great (apart from the fact that he uses Visual Studio 2008 as his editing environment!). If you prefer video’s to books (or just like a combination) then you…","frontmatter":{"date":"February 24, 2009","path":"/blog/tutorial-link-jquery-for-absolute-beginners/","title":"Tutorial Link: jQuery for Absolute Beginners"}}},{"node":{"id":"2cefdc0a-cb73-5928-9cff-8a911a58081e","excerpt":"Geocoding and PapervisionIn the June 2008 edition of the Adobe Edge newsletter, there was an article \"Learn how to geocode with Papervision3D and Adobe Flex\".  You can also view the demo directly.Pretty awesome, eh?  All of the sample source code is…","frontmatter":{"date":"February 23, 2009","path":"/blog/geocoding-google-maps-locations-to-a-papervision3d-globe/","title":"Geocoding Google Maps locations to a Papervision3D globe."}}},{"node":{"id":"183e4e54-6d42-5553-9945-87d99b62131e","excerpt":"Scroll down and watch the videohttp://www.sebleedelisle.com/?p=383","frontmatter":{"date":"February 19, 2009","path":"/blog/link-papervision3d-wormhole-in-your-webcam/","title":"Link: Papervision3D wormhole in your webcam!"}}},{"node":{"id":"4db184e5-f2c1-5dcd-93f6-bc48d0cab0fa","excerpt":"http://dougmccune.com/blog/2009/02/08/analyzing-the-size-of-the-flex-framework-or-why-i-hate-the-advanceddatagrid/","frontmatter":{"date":"February 19, 2009","path":"/blog/link-why-the-flex-advanceddatagrid-sucks/","title":"Link: Why the Flex AdvancedDataGrid sucks"}}},{"node":{"id":"8fb85fb3-d07e-59b1-9cce-0150876cb9b8","excerpt":"Palm (the mobile phone maker) has joined the Open Screen project - which means the next generation of Palm smartphones will come with the Flash Player installed (they should be available around end of 2009):http://www.businesswire.com/portal/site…","frontmatter":{"date":"February 17, 2009","path":"/blog/the-open-screen-project/","title":"The Open Screen Project"}}},{"node":{"id":"ca933de9-9f16-5df4-aa33-42649e88d4b4","excerpt":"One thing that could severely affect peoples' general opinion of a technology is how it's used, how it's implimented. AIR in itself isn't a technology that is really any better or worse than its competitors - it's the usage that makes the difference…","frontmatter":{"date":"February 15, 2009","path":"/blog/best-practice-for-air-applications-1-of-7/","title":"Best Practice for AIR applications (1 of 7)"}}},{"node":{"id":"d85a6efb-dca6-5fac-bafb-2d8a37c574ac","excerpt":"A couple of days ago Adobe relaunched the AIR Marketplace - the official repository of AIR applications available for download - and with it made things a lot more accessible for 'Publishers' to add their applications to the Marketplace.  I'm not…","frontmatter":{"date":"February 13, 2009","path":"/blog/imagesizer-is-now-available-from-the-adobe-air-marketplace/","title":"ImageSizer is now available from the Adobe AIR Marketplace!"}}},{"node":{"id":"fbccd184-9546-5dd2-ac6e-c14839baa8ac","excerpt":"Pixel Bender is awesome - but I just haven't got into it yet, so I have no idea how to make my own useful or impressive filters.  Nevermind, there's always the Pixel Bender Exchange from Adobe.  Not enough?  Well, one thing I like about AIR…","frontmatter":{"date":"February 12, 2009","path":"/blog/how-to-poach-pixel-bender-filters/","title":"How to: poach Pixel Bender filters."}}},{"node":{"id":"637fe13f-eedf-55e6-8e32-bc578fc6b331","excerpt":"Here's a few useful posts concerning Authentication of HTTP requests.In Flex (with HTTP Service class): http://www.geekzguru.net/howto-add-basic-authentication-header-to-httpservice/In Flex (with URLLoader class): http://www.abdulqabiz.com/blog…","frontmatter":{"date":"February 10, 2009","path":"/blog/sending-authentication-headers-in-flex/","title":"Sending Authentication Headers in Flex"}}},{"node":{"id":"35777de9-1f86-5415-ad25-8378ad85e4b2","excerpt":"JavaScript debugging is a real pain.  Not only do you have the not-infrequent browser discrepancies, but the normal debugging tools aren't fantastic.  With some advanced debugging tools though, you might just figure out which 'Object is null or does…","frontmatter":{"date":"February 06, 2009","path":"/blog/advanced-debugging-with-javascript/","title":"Advanced Debugging with JavaScript"}}},{"node":{"id":"6b9ecb6e-0836-54bc-acb7-907558c36a97","excerpt":"Well, I was going to go and write all about this myself, but Matthew McNeely has beaten me to it, it seems, with his coverage of using Google Analytics in Flash and Flex applications. Go check it out!http://www.insideria.com/2009/02/using-google…","frontmatter":{"date":"February 05, 2009","path":"/blog/google-analytics-within-flexflash-applications/","title":"Google Analytics within Flex/Flash Applications"}}},{"node":{"id":"7cc3529c-f0ff-53b5-9fc1-f51252a3adf6","excerpt":"Some might say slow on the uptake, some would argue that I'm not jumping on the bandwagon without considering where it's going.In the end it was Will Hawkins [blog, twitter] that convinced me to start using Twitter a bit more - even without the…","frontmatter":{"date":"February 05, 2009","path":"/blog/im-on-twitter/","title":"I'm on Twitter."}}},{"node":{"id":"1f8a7633-d627-5bed-8b27-a3fbf356975c","excerpt":"Can you do it?  No you can't.Not directly anyway - Arrays aren't something that data binding works with in Flex.  ArrayCollection however, is something you can work with.  To use an Array as a bindable object, you can wrap it in an ArrayCollection…","frontmatter":{"date":"February 02, 2009","path":"/blog/data-binding-an-array-in-flex/","title":"Data Binding an Array in Flex?"}}},{"node":{"id":"fe1766a7-6efe-5cb7-bd9f-4fffc7262947","excerpt":"http://blogs.adobe.com/loridefurio/2008/07/pdf_widget_on_a.htmlIt’s pretty much the new version of Flash Paper, this site shows you how to convert a pdf to a flash widget (which presumably you can download and then delete off Acrobats’ site)","frontmatter":{"date":"February 02, 2009","path":"/blog/creating-a-pdf-widget-on-acrobatcom/","title":"Creating a PDF Widget on Acrobat.com"}}},{"node":{"id":"37952542-4976-51e0-a90d-8552e59280ae","excerpt":"Ok, this isn't going to be a tutorial - not yet anyways.  So many projects, so little time to write about them.As part of my attempts to improve the way I work, I've been on the look out for a private hosting solution for Subversion, that comes with…","frontmatter":{"date":"January 29, 2009","path":"/blog/building-a-project-tracker-in-flex-air/","title":"Building a project tracker in Flex & AIR"}}},{"node":{"id":"0babeae9-7466-5d18-ab51-e65381beeefc","excerpt":"Here's one reason why Photoshop CS4 kicks ass (here's something completely new).It's called \"Content-Aware Scale\".  Unlike the transform controls from previous iterations, this scaling mode is somehow aware of the contents of an image and can discern…","frontmatter":{"date":"January 28, 2009","path":"/blog/a-reason-why-photoshop-cs4-kicks-ass/","title":"A reason why Photoshop CS4 kicks ass"}}},{"node":{"id":"ca4b07c8-d3e2-50d5-860d-5bcb41aa1cc3","excerpt":"This is an interesting article for 'A List Apart' - basically discussing the fact that Web Education (ie. Design, Development and concepts) and the education model is progressing too slow for it to keep pace with its subject material.  I, and several…","frontmatter":{"date":"January 28, 2009","path":"/blog/brighter-horizons-for-web-education/","title":"Brighter Horizons for Web Education"}}},{"node":{"id":"22490eb1-f5fb-5dc0-ac38-968c0bf95354","excerpt":"I'm a bit of a slave to my own ideas - why else would I spend my evenings knocking together a whole host of not-really-nessesary features for a simple application?  I have to many ideas I want to impliment and too little time to do it, so I'm also…","frontmatter":{"date":"January 23, 2009","path":"/blog/imagesizer-now-with-a-feedback-form/","title":"ImageSizer - now with a Feedback form!"}}},{"node":{"id":"c5f49437-42ce-5178-b1d8-6c25f1b0f784","excerpt":"http://blog.everythingflex.com/2009/01/21/degrafa-auto-shaped/","frontmatter":{"date":"January 22, 2009","path":"/blog/auto-shapes-for-defraga/","title":"Auto shapes for Degrafa"}}},{"node":{"id":"5f05befe-70f7-5977-8a3a-ff362ec48212","excerpt":"Well, I'm a bit slack on the whole updates front - ImageSizer 0.4.0 and 0.4.1 have already slipped under the radar without a blog post - but with the latest release I thought I'd draw a little attention to it, not least because it fixes a bit an…","frontmatter":{"date":"January 20, 2009","path":"/blog/introducing-imagesizer-042/","title":"Introducing ImageSizer 0.4.2"}}},{"node":{"id":"24458441-9d57-59a6-b916-035d9bd81c36","excerpt":"http://www.tomanthony.co.uk/blog/geocoding-uk-postcodes-with-google-map-api/Awesome news, you can actually Geocode UK Postcodes - without having to shell out on licensing costs to Royal Mail.Ok, so the post may be 2 years old, but I'm a little slow…","frontmatter":{"date":"January 20, 2009","path":"/blog/geocoding-uk-postcodes-with-google-map-api/","title":"Geocoding UK Postcodes with Google Map API"}}},{"node":{"id":"1faafd96-89e7-552d-b945-fe58e1a07fbc","excerpt":"What are you talking about?Recently I've been toying around with using [Bindable] Metadata in Flex and AS3, namely trying to not only make it so that my static variables can be used as bindings in Flex, but also that I can detect when the variables…","frontmatter":{"date":"January 19, 2009","path":"/blog/using-bindable-changewatcher-in-actionscript-only-classes/","title":"Using [Bindable] & ChangeWatcher in ActionScript-only classes"}}},{"node":{"id":"d260dcd2-b258-51d6-8b89-aa213b100992","excerpt":"Here's a couple of useful videos from the Adobe TV site.  Yes, a custom chrome is one of the first things that people want to learn how to do, and yes, there's lots of other tutorials around that talk about this - but even after having read many of…","frontmatter":{"date":"January 15, 2009","path":"/blog/creating-custom-chromes-for-air-applications-in-flex-flash/","title":"Creating custom chromes for AIR applications in Flex & Flash"}}},{"node":{"id":"87788d6f-d422-5bb1-824a-f071b37e91dd","excerpt":"Will Hawkins asks, \"Will LinkedIn and Twitter kill telemarketing?\". An interesting thought, based off a recent business experience where using Twitter and LinkedIn proved much more successful than hiring a whole telemarketing company.I can't be…","frontmatter":{"date":"January 15, 2009","path":"/blog/will-linkedin-and-twitter-kill-telemarketing/","title":"Will LinkedIn and Twitter kill telemarketing?"}}},{"node":{"id":"4bdcfa48-3936-5f80-88b7-bcf653ef2061","excerpt":"Here's an interesting Demo from the guys at Intuilab.  It's a multitouch system, much like the much-touted Microsoft Surface.  Only this one sounds like it's built from scratch and, more importantly for me, is developed in AIR.That it's built in AIR…","frontmatter":{"date":"January 15, 2009","path":"/blog/multitouch-applications-with-air/","title":"Multitouch Applications with AIR"}}},{"node":{"id":"66d2a881-6d10-5855-819d-04deeca4f33a","excerpt":"\"Here Be Pixels\" by Mario Klingemann is an interesting presentation from MAX 2008.In it, Mario talks about using bitmaps and bitmapdata with cameras to do everything from a barcode reader to augmented reality.  He doesn't cover the code, but does…","frontmatter":{"date":"January 12, 2009","path":"/blog/there-be-pixels/","title":"There Be Pixels!"}}},{"node":{"id":"c7f310bf-1021-5f40-b810-c83586620e60","excerpt":"Ryan Stewart blogged earlier about getting code completion in Flex Builder with the aid of Metadata in your actionscript, and it's all very interesting - so take a look!  Flash CS4 also now supports the Flex-style Metadata tags in your actionscript…","frontmatter":{"date":"January 12, 2009","path":"/blog/code-completion-and-other-flex-metadata-tricks/","title":"Code Completion and other Flex Metadata tricks..."}}},{"node":{"id":"fb2835d2-3e33-5b3f-a86e-58a70714e7ae","excerpt":"http://www.cynergysystems.com/blogs/page/andrewtrice?entry=visualizing_large_data_setsSome pretty large data sets going off here...","frontmatter":{"date":"January 09, 2009","path":"/blog/visualizing-large-data-sets-in-flexflash/","title":"Visualizing LARGE Data Sets in flex/flash"}}},{"node":{"id":"a19ce843-a408-5b09-a489-5aff449ffa30","excerpt":"Cyn.in is an AIR-based communications.. um.. thing?  It seems designed for group collaborative projects, with things like status messages and file sharing.  Cyn.in stands for 'sign in' (I got it, eventually. - I don't think phonetic puns work very…","frontmatter":{"date":"January 08, 2009","path":"/blog/cynin-desktop/","title":"Cyn.in Desktop"}}},{"node":{"id":"d9274a2e-84be-54ed-bac2-6ad411e9e85f","excerpt":"Some time soon(ish) I'll get around to this myself, but the Adobe Developer Center now contains a short overview of the Google Analytics classes for flash, written by Nick Mihailovski:http://www.adobe.com/devnet/flash/articles/google_analytics_flash…","frontmatter":{"date":"January 06, 2009","path":"/blog/using-google-analytics-in-flash/","title":"Using Google Analytics in Flash"}}},{"node":{"id":"98d29036-9ae5-5d04-a9e2-3be297182d98","excerpt":"I’m sure I’m not the only one that wants to make use of their existing skills in Flash to create Flex components without getting bogged down by creating it all in ActionScript classes, overriding lots of methods and generally getting in a mess. Don’t…","frontmatter":{"date":"January 05, 2009","path":"/blog/creating-flex-components-the-easy-way-for-flash-ide-converts/","title":"Creating Flex Components - the easy way (for Flash IDE converts)"}}},{"node":{"id":"5ffcb629-9776-5f74-a93d-af3d2eaa0954","excerpt":"I'll try not to be boring and post every single time I make an update, but what the hell, I kinda like this update - even if it introduces nothing useful on the functionality front.Version 0.3.10 of ImageSizer is now upgraded to use the AIR 1.…","frontmatter":{"date":"December 22, 2008","path":"/blog/imagesizer-updated-to-version-0310/","title":"ImageSizer - updated to version 0.3.10!"}}},{"node":{"id":"75c53e43-1b08-518a-8055-feba1ef2c302","excerpt":"You can install it from here, when you first go to the page click \"I want to be a labs tester\", then visit the link again and you'll be able to download it.http://www.bbc.co.uk/iplayer/install/bbc_iplayer_desktopOne of it's coolest features I've seen…","frontmatter":{"date":"December 22, 2008","path":"/blog/bbc-releases-an-air-version-of-the-iplayer/","title":"BBC Releases an AIR version of the iPlayer"}}},{"node":{"id":"bd3ecde1-66f5-57bf-bfb3-2af250ec6a6a","excerpt":"[MMT Digital's Christmas E-Newsletter is due out soon, so I thought it might be a pertinent time to recap our earlier email, the Autumn E-Newsletter. And hey, this isn't just a company promotional post, I actually want to blog this, because I very…","frontmatter":{"date":"December 19, 2008","path":"/blog/e-newsletter-the-benefits-of-using-adobe-air/","title":"E-Newsletter / The benefits of using Adobe AIR."}}},{"node":{"id":"79376433-6d59-590b-9d70-2a049528d37a","excerpt":"http://www.noupe.com/icons/50-most-beautiful-icon-sets-created-in-2008.html [Update: Original link dead!]http://www.noupe.com/freebie/50-most-beautiful-icon-sets-created-in-2008.html [Update 2: New link found!]","frontmatter":{"date":"December 19, 2008","path":"/blog/need-some-glossy-icons/","title":"Need some glossy icons?"}}},{"node":{"id":"9077d62e-1249-5f70-8a13-db22ba553d10","excerpt":"This is one of the new flash 10 RIAs that had everyone excited at Flash on the Beach, it's amazing! http://www.hobnox.com/index.1056.en.html","frontmatter":{"date":"December 19, 2008","path":"/blog/hobnox-audiotool/","title":"Hobnox AudioTool"}}},{"node":{"id":"132fd6e9-1f0c-5ce5-ad99-f2289756300b","excerpt":"I like cookies - they're like the poor man's server-side session.Yes, Cookies aren't 100% reliable, I know, but I think for a lot of things, they're a damned good solution.  Flash has it's own version of cookies, of course - called Shared Objects…","frontmatter":{"date":"December 19, 2008","path":"/blog/mmm-cookies-in-actionscript-javascript/","title":"Mmm... Cookies. In ActionScript / JavaScript."}}},{"node":{"id":"4024e86a-5eeb-5a80-9f8b-571d09af206b","excerpt":"Or to be more specific, what the hell are the \"Accelerators\" and the \"Web Slices\"?You can download the Internet Explorer 8 Beta from http://www.microsoft.com/windows/internet-explorer/beta/default.aspx.  Overall, it's quite an interesting update…","frontmatter":{"date":"December 18, 2008","path":"/blog/ie8-beta-goes-public-and-what-are-those-new-features/","title":"IE8 Beta goes public - and what are those new features?"}}},{"node":{"id":"9a0448d2-6acd-5193-a095-48d77465c46d","excerpt":"If anyone out there is using Marks' ImageSizer AIR application, you may have noticed a new update has appeared - imaginatively called 'Version 0.3.9'.Functionality wise, the primary changes are that the restrictions on the number of images that can…","frontmatter":{"date":"December 16, 2008","path":"/blog/imagesizer-updated-to-version-039/","title":"ImageSizer - updated to version 0.3.9!"}}},{"node":{"id":"64bfdafe-90af-5670-95c3-911e21d8b9d0","excerpt":"For all of its wonderful components, Flex doesn't seem to have anything that can easily play an flv.  Even the examples in the Tour De Flex application all use basic Flex buttons, rather than the more interactive FLVPlayback component, which leaves…","frontmatter":{"date":"December 16, 2008","path":"/blog/using-the-flvplayback-component-in-flex/","title":"Using the FLVPlayback component in Flex"}}},{"node":{"id":"9c22cfda-f15f-5cf1-bbe7-d752afc11d59","excerpt":"In CS4, the help system in Flash is set to online by default, which means pressing F1 opens a new browser window, takes you to LiveDocs and, most of the time, gives you no useful information whatsoever - and takes over half a minute to load.  Luckily…","frontmatter":{"date":"December 10, 2008","path":"/blog/how-to-make-the-flash-cs4-help-and-language-reference-available-offline/","title":"How to make the Flash CS4 Help and Language reference available offline."}}},{"node":{"id":"8914ead1-51ed-5eb1-8b21-f36f44803f5b","excerpt":"http://labs.bigspaceship.com/2008/12/09/air-app-as3-language-reference/","frontmatter":{"date":"December 10, 2008","path":"/blog/as3-language-reference-in-an-air-application/","title":"AS3 Language Reference in an AIR application"}}},{"node":{"id":"cd925fbe-d720-507f-a995-ea19c369fb41","excerpt":"My first introduction to GetSatisfaction came through Flex My Day, and it all looks pretty cool.  The company/service is all about providind a medium for companies with large consumer bases to get in touch with what their clients actually want, which…","frontmatter":{"date":"December 10, 2008","path":"/blog/got-satisfaction-getsatisfaction/","title":"Got satisfaction? GetSatisfaction."}}},{"node":{"id":"7e42b068-69d8-5400-8dd9-cb4d47dcc568","excerpt":"Blogsessive has a really nice post on \"20 Free Corporate Wordpress Themes\", over at http://blogsessive.com/blogging-tips/20-corporate-free-wordpress-themes/.A couple of my favourates are the Modern and Corporate Sandbox, but Basic, Deadwood Lite and…","frontmatter":{"date":"December 09, 2008","path":"/blog/time-for-a-blog-refresh/","title":"Time for a blog refresh..."}}},{"node":{"id":"ceffb112-c8c4-5021-9ba9-b65e3a176704","excerpt":"I got sent this earlier and found it amusing, so what the heck - enjoy!Or view it on YouTube: http://uk.youtube.com/watch?v=gdAKgJDahzw","frontmatter":{"date":"December 05, 2008","path":"/blog/the-real-computer-monster/","title":"The real Computer Monster"}}},{"node":{"id":"c7491776-725e-550c-8c02-ba314fc16bce","excerpt":"http://blogs.adobe.com/air/2008/11/air_recipes_tips_and_tricks_fo.html","frontmatter":{"date":"December 04, 2008","path":"/blog/air-recipes-tips-and-tricks-for-air-application-development/","title":"AIR Recipes: Tips and Tricks for AIR Application Development"}}},{"node":{"id":"d2cc2f53-cafe-514c-90c0-8a15de562419","excerpt":"So I'm hacking together a simple client-side AJAX - based on AHAH - and all of the example scripts only work with a single request.  Attempting to use the same script twice meant that the results would overwrite each other.  Ughh.The problem it…","frontmatter":{"date":"December 03, 2008","path":"/blog/executing-multiple-xmlhttprequests-successfully/","title":"Executing multiple XMLHTTPRequests - successfully."}}},{"node":{"id":"f267df93-e86c-5d52-bacf-01ca33174a24","excerpt":"As I've been playing around with the ApplicationInfo class, I thought my Splash Screen stuff would be so much nicer if it were a little more... generic?So with that in mind, I've updated my Flex Splash screen project to impliment the ApplicationInfo…","frontmatter":{"date":"December 02, 2008","path":"/blog/my-splash-screen-example-updated-with-applicationinfo-class/","title":"My Splash Screen example - updated with ApplicationInfo class"}}},{"node":{"id":"b5bc9271-6d7a-5299-b8ae-26915ff32143","excerpt":"Or should I say, finally introducing ImageSizer.  If you've been here previously in the last couple of weeks, you might have noticed that a couple of links to an ImageSizer application have been floating around.  Back in September (at Flash on the…","frontmatter":{"date":"December 02, 2008","path":"/blog/resize-multiple-images-and-package-them-for-e-mail-transmission-introducing-imagesizer/","title":"Resize multiple images and package them for e-mail transmission - introducing ImageSizer!"}}},{"node":{"id":"cdfd4844-72c6-58a6-8c7c-36d58ba08cce","excerpt":"Application Descriptior Manager is another application like the AIR Badger and Icon Generator - a development tool, built in AIR, for developing AIR applications.  It's useful, functional and has reassuring touches like auto-backup, or version…","frontmatter":{"date":"December 02, 2008","path":"/blog/adm-application-descriptor-manager/","title":"ADM - Application Descriptor Manager"}}},{"node":{"id":"1d77bb14-b8cc-525b-b16b-3d9f27042409","excerpt":"Well, I've finally gone and done it - I've now got a project on Google code and I now feel like a proper part of the coding community.  We'll see how long that lasts.  I've just uploaded the first version of my AIR ApplicationInfo class, and no doubt…","frontmatter":{"date":"December 01, 2008","path":"/blog/getting-your-source-code-hosted-on-google-code/","title":"Getting your source code hosted on Google Code..."}}},{"node":{"id":"bfb827b8-64f0-56c2-8d2f-0d6b6114ddb8","excerpt":"Extracting the application information for an AIR application is in some ways a simple process - it's not like the process is too difficult - it's a bit of E4X on some data that is readily accessible from the application itself.  But if you're like…","frontmatter":{"date":"December 01, 2008","path":"/blog/application-information-class-for-air/","title":"Application Information Class for AIR"}}},{"node":{"id":"a528f6a9-23e3-5366-bd3d-9c4f29602c12","excerpt":"Ugh, this E4X stuff is all a bit new to me - I'm still not used to namespaces and stuff.  For some reason I've had trouble extracting data from XML when I'm using a namespace.  I have no idea why, but it seemed that with the namespace in use, my…","frontmatter":{"date":"December 01, 2008","path":"/blog/darn-them-xml-namespaces/","title":"Darn them XML namespaces!"}}},{"node":{"id":"bd865e63-288b-511d-895d-d1f950a4bdf4","excerpt":"[Adobe Wave is just one of the interesting projects on the Adobe Labs site - a \"one-line API call\" for displaying desktop notifications, built on Adobe AIR and hosted by Adobe.  Adobe are certainly committed to making AIR a success, and one of the…","frontmatter":{"date":"November 27, 2008","path":"/blog/interesting-things-in-adobe-labs-adobe-wave/","title":"Interesting things in Adobe Labs - Adobe Wave"}}},{"node":{"id":"4054f85a-a209-51d7-8330-cd085b0c6ce3","excerpt":"Ah, the old splash screen - a familiar thing for anyone using Adobe products, I should imagine.I'm going to skip the arguements for and against a splash screen on your application, and assume there's a valid reason for having one - this is mainly a…","frontmatter":{"date":"November 26, 2008","path":"/blog/minute-flex-air-tutorial-creating-your-application-splash-screen/","title":"10 minute Flex / AIR tutorial - Creating your Application Splash Screen."}}},{"node":{"id":"e3971f3e-dd2b-5133-bfe1-9304ebfbe490","excerpt":"It's a fast-paced industry, with Digital Production studios (like us) transforming all manner of content from clients into wide variety of other formats. We'll take school textbooks for example and transform them into interactive textbooks, or…","frontmatter":{"date":"November 25, 2008","path":"/blog/desktop-mashups/","title":"Desktop Mashups?"}}},{"node":{"id":"8cc163ef-6d7b-511a-b2a0-ab2ae97885c9","excerpt":"Tour de Flex is a desktop application for exploring Flex capabilities and resources, including the core Flex components, Adobe AIR and data integration, as well as a variety of third-party components, effects, skins, and more.[Head on over to Flex…","frontmatter":{"date":"November 25, 2008","path":"/blog/tour-de-flex/","title":"Tour de Flex"}}},{"node":{"id":"fdc9e67b-1e83-5f28-9c58-e421d144405e","excerpt":"http://www.developerfusion.com/news/article/9274/adobe-flex-reaches-out-to-net-developers/","frontmatter":{"date":"November 24, 2008","path":"/blog/adobe-flex-reaches-out-to-net-developers/","title":"Adobe Flex reaches out to .NET developers"}}},{"node":{"id":"ec888121-4bd5-561e-936a-9b42e38567b7","excerpt":"http://blog.everythingflex.com/2008/11/17/introducing-adobe%c2%ae-air%e2%84%a2-15/","frontmatter":{"date":"November 17, 2008","path":"/blog/air-15-is-now-available/","title":"AIR 1.5 is now available!"}}},{"node":{"id":"e1a719a2-e307-5654-947a-cd0cf92cab27","excerpt":"Ok, so it's a bit belated.  I was trying to do the whole geeky blogging thing after each day of Flash on the Beach, but guess what got in the way?  Work.  Work and parties.  Ok, maybe parties and then work, but I'm blaming both equally.Unfortunately…","frontmatter":{"date":"October 31, 2008","path":"/blog/flash-on-the-beach-2008-days-2-3-roundup/","title":"Flash on the Beach 2008 days 2 & 3 roundup."}}},{"node":{"id":"79393a12-9686-510b-b9b7-f5cb218301b9","excerpt":"Scalenine has always been a cool place to see some awesome Flex artwork - for ages now they've had lovely skins like Obsidian or WMP11, but they've recently ran a 'skin to win' competition and have released the winning entries on their site: http…","frontmatter":{"date":"October 22, 2008","path":"/blog/grab-some-flex-skins/","title":"Grab some Flex skins."}}},{"node":{"id":"8ed89c6d-3031-51e5-934e-57a24b1c08ec","excerpt":"http://events.carsonified.com/fowa/2008/london/contentI didn't go to this one, so it's really thanks to Andrew Shorten that I found the link, but it looks like FOWA have put videos of the vast majority of all of their sessions online for viewing…","frontmatter":{"date":"October 16, 2008","path":"/blog/fowa-08-future-of-web-apps-conference-videos/","title":"FOWA '08 (Future of Web Apps conference) - Videos"}}},{"node":{"id":"6cdd5a61-de9c-583c-a1b2-0562230a56fd","excerpt":"Yes, Flash Player 10 is now live.[I was a little surprised because I hadn't thought that Flash 10 was going to go live anytime soon - in fact I'm still not sure if CS4 is available yet.  Adobe seems to spend so much time hyping various things that I…","frontmatter":{"date":"October 15, 2008","path":"/blog/flash-player-10-is-live/","title":"Flash Player 10 is Live"}}},{"node":{"id":"b60b56ac-2a53-5c4d-8c63-696e7525a388","excerpt":"Tweeners' great, but I came across one little problem the other day: when I tried to remove an externally loaded swf from the stage while it was mid-animation, Tweener could bring the whole Flash movie to a halt with the error '256 levels of…","frontmatter":{"date":"October 13, 2008","path":"/blog/tweener-and-256-levels-of-recursion-were-exceeded-in-one-action-list/","title":"Tweener and \"256 levels of recursion were exceeded in one action list\""}}},{"node":{"id":"8b702761-08fe-55b8-83f7-83a40b685632","excerpt":"A little while ago we had to do a Fish Eye menu - the magnification effect you see on the Mac OSX dock menu - but we had to do it in ActionScript 2.0, rather than ActionScript 3.0.Now, Shine Draw have been kind enough to put a version of this out…","frontmatter":{"date":"October 12, 2008","path":"/blog/fish-eye-menu-in-actionscript-20/","title":"Fish Eye Menu in ActionScript 2.0"}}},{"node":{"id":"5d862024-7fa3-5fc4-aad8-1aa93a862d2c","excerpt":"Wow.  That's another day gone - its funny really, you feel like you've been here for ages based on what you've seen, but then you step back and realise it's only Monday.John Davis' Keynote was a good introduction - teasing us with the features of…","frontmatter":{"date":"September 30, 2008","path":"/blog/fotb-day-one/","title":"FOTB: Day One"}}},{"node":{"id":"f4ef6e39-9fad-5a10-9202-148ba8898e35","excerpt":"[It's coming up to 8pm on Sunday 28th, and that means the Workshops day for Flash on the Beach 2008 is over - but the fun begins again in only another 12 hours, with talks such as \"Brilliant Ideas that I've blatantly stolen\", \"Mash-up widgets with…","frontmatter":{"date":"September 28, 2008","path":"/blog/fotb-day-zero/","title":"FOTB: Day Zero"}}},{"node":{"id":"ea92e78a-1f91-5995-9d69-5f010c726843","excerpt":"This tool (Badger) allows you to easily create air badges for use on your website and offers live previews of the badge. Grant Skinner explains…http://www.gskinner.com/blog/archives/2008/09/beware_the_air.htmlAlso, see the article \"Using Badger for…","frontmatter":{"date":"September 24, 2008","path":"/blog/introducing-the-air-badger/","title":"Introducing the AIR Badger..."}}},{"node":{"id":"a4927eee-7b6b-530a-9d02-10342c3f3480","excerpt":"http://www.adobe.com/devnet/flex/articles/apps_students.html","frontmatter":{"date":"September 18, 2008","path":"/blog/back-to-school-top-10-adobe-flex-and-air-applications-for-students/","title":"Back to School: Top 10 Adobe Flex and AIR applications for students"}}},{"node":{"id":"2aa7358b-705d-524c-aefc-1a96530c63a0","excerpt":"The problem:Your XML file is fine, it validates as XML.  The file encoding and the xml declaration encoding match.  You can parse the XML, but when you try and put html inside a CDATA element, and then populate a dynamic textbox with it, either your…","frontmatter":{"date":"September 17, 2008","path":"/blog/actionscript-2-xml-cdata-returns-undefined-or-htmltext-doesnt-work/","title":"ActionScript 2 - XML CDATA returns undefined, or htmlText doesn't work!"}}},{"node":{"id":"f6e39fad-11d8-59b0-be24-b8d321179aaf","excerpt":"Google have released the google analytics on their google code service – which basically means they’re opening up the API & stuff like that in a similar way to the way google maps works, and allows you to configure and customise it.http://analytics…","frontmatter":{"date":"September 12, 2008","path":"/blog/google-analytics-unveiled/","title":"Google Analytics — Unveiled."}}},{"node":{"id":"299928e1-5d46-5898-b3ba-c631d0bec1ee","excerpt":"If you've been living under a rock for the past week - or maybe just been on holiday - you might not've heard about Google's new web browser called Google Chrome.  Chrome is a direct competitior to other browsers such as Internet Explorer, Firefox or…","frontmatter":{"date":"September 10, 2008","path":"/blog/google-chrome-is-kinda-awesome/","title":"Google Chrome is kinda awesome..."}}},{"node":{"id":"8343558e-ea63-5d43-b519-be5dc0b9422b","excerpt":"It seems like fun physics games are on the rise - there's Launchball, which I've mentioned before - but there also seems to be a rise in the numbers of other simple physics games created in Flash. Maybe its because of as3 libraries like APE making…","frontmatter":{"date":"August 25, 2008","path":"/blog/all-these-physics-games/","title":"All these physics games..."}}},{"node":{"id":"488f224d-d745-5fb1-a556-6e2bc543859b","excerpt":"Well, if you're using the AIR Install Badge - as Greg Wilson demonstrates - it can be surprisingly easy. The Install Badge handles the launching of your application (if you have it already installed), the installation of your application (if you have…","frontmatter":{"date":"August 23, 2008","path":"/blog/just-how-easy-can-you-make-an-air-application-installation/","title":"Just how easy can you make an AIR application installation?"}}},{"node":{"id":"b7d00199-fc2b-5945-a853-b239707e8410","excerpt":"As you probably know, Actionscript 2 and Actionscript 3 projects aren't completely compatable - they can't be, what with all the changes under the hood.  Migrating your own coding techniques is hard enough, but migrating projects can be so much…","frontmatter":{"date":"August 20, 2008","path":"/blog/actionscript-2-to-actionscript-3-communication-try-flashinterface/","title":"Actionscript 2 to Actionscript 3 communication? try FlashInterface..."}}},{"node":{"id":"99d0327a-0ef8-56ee-8d2e-c9adcd05bcbe","excerpt":"You mightn't think it was possible, the lack of implimentations you see for it on a day-to-day basis, but actually you can create Calendar events for a wide range of email / organiser clients using the iCalendar file format.From the users' point of…","frontmatter":{"date":"August 07, 2008","path":"/blog/creating-outlook-calendar-events-through-http-links/","title":"Creating Outlook Calendar events through hyperlinks"}}},{"node":{"id":"e1f16260-d825-5718-a4fa-e472dc9361e4","excerpt":"Well, that was fast (and rightly so).  This morning I posted about the BBC Sports' Olympics AIR Application containing a text file of offensive language but now, roughly 1.5 hours after posting here, and 6.5 hours after it being initally posted, a…","frontmatter":{"date":"August 05, 2008","path":"/blog/bbc-sports-air-application-removes-its-offensive-language/","title":"BBC Sports' AIR Application removes its offensive language"}}},{"node":{"id":"478f945c-406f-57f1-9bf6-efde12aa4648","excerpt":"James Cannings from MMT Digital alerted me to this, and has written a post about it at: http://www.mmtdigital.co.uk/monkeymagic, and here's my thoughts on it:You can install the BBC Sport’s Desktop Monkey at: http://news.bbc.co.uk/sport1/hi/olympics…","frontmatter":{"date":"August 05, 2008","path":"/blog/bbc-uses-air-to-install-a-list-of-swear-words-to-users-machines/","title":"BBC uses Adobe AIR to install a list of swear words to users machines."}}},{"node":{"id":"39e91ee4-2858-5576-a38a-d926841d221a","excerpt":"Tweener (caurina.transitions.Tweener) is a Class used to create tweenings and other transitions via ActionScript code for projects built on the Flash platform.To use Tweener in your projects, the first step is to download the class files that will…","frontmatter":{"date":"July 18, 2008","path":"/blog/exempli-gratia-using-tweener/","title":"Exempli Gratia : Using Tweener"}}},{"node":{"id":"a54cd1ec-7c82-5998-9839-4902633d2598","excerpt":"If you're still using Flash's inbuilt Tween classes for you scripted animations, I suggest you stop - and start making things easier for yourself by using Tweener instead. Tweener is a class that replaces Tween, works for Actionscript 2 and…","frontmatter":{"date":"July 12, 2008","path":"/blog/stop-using-mxtransitionstween/","title":"Stop using mx.transitions.Tween;"}}},{"node":{"id":"6ac7796e-a050-5970-9a24-427506983ba9","excerpt":"[Google Code Jam is a pretty much a coding competition.  You can use any programming language you like, they'll give you a problem, and you have to solve it.  Sound fun?  Well, you have between four and eight minutes to submit your answers, and you…","frontmatter":{"date":"July 01, 2008","path":"/blog/feeling-smart-try-googles-code-jam/","title":"Feeling smart? Try Google's Code Jam"}}},{"node":{"id":"454b438c-cd50-57bd-88c8-c074354a3710","excerpt":"Adobe have just released their first major update to AIR since its release, Adobe AIR 1.1 (catchy!). - The release notes of which you can read here.Aside from a few tweaks and general updates, and a few requested features making an appearance, the…","frontmatter":{"date":"June 18, 2008","path":"/blog/adobe-air-gets-serious/","title":"Adobe AIR gets serious?"}}},{"node":{"id":"03f5b132-6bac-5c49-b2fb-dc5bf71aa7a6","excerpt":"Ok, so I've been muttering a lot recently about Facebook and Flash. It's something I'm interested in - because I believe it's one great way to expose your Flash games to lots of users - but just not something I've had time to bring to fruition.It…","frontmatter":{"date":"June 17, 2008","path":"/blog/links-for-integrating-flash-and-facebook/","title":"Links for integrating Flash and Facebook"}}},{"node":{"id":"8c2bce26-2d9b-5e21-90d2-d7d25a60df85","excerpt":"I'm very impressed with Launchball, a Flash game from the Science Museum.I love the design, I love the interface - its unique, simple and very swish. Once I started playing the game I was staggered by how fully realised it is - no skimping on the…","frontmatter":{"date":"June 16, 2008","path":"/blog/launchball-an-awesome-flash-game/","title":"Launchball - an awesome Flash game"}}},{"node":{"id":"37b48af8-7605-5f35-964b-cab69c70dfa6","excerpt":"I've been pondering Flash games for a while now, and it occurred to me that I don't quite see so many as I thought I used too. I don't know - maybe its because I just move in different circles now I'm in the 'professional' world, but it seems like…","frontmatter":{"date":"June 11, 2008","path":"/blog/whats-up-with-flash-gaming/","title":"What's up with Flash gaming?"}}},{"node":{"id":"5c2d59cb-b1f0-5a68-9bd9-416021f2f3a8","excerpt":"I have been trying to figure out how to set get a session cookie from Flash via Javascript. Yes, Flash does have a limited ability to set its own 'cookies' with something called LocalStorage, but there are a few advantages to actually creating 'real…","frontmatter":{"date":"June 08, 2008","path":"/blog/flashjavascript-problems-in-a-net-content-managed-website/","title":"(Flash/Javascript) problems in a .Net Content-Managed Website"}}},{"node":{"id":"c2dda54f-8fc3-54ed-8564-10cc0c741f12","excerpt":"Surfing BBCi's interactive tv services, I couldn't help take notice of one ominous sounding news report - \"Skynet military launch postponed\" - yee gads! Skynet ?!It gets better with this quote;Software on the launch vehicle did not behave normally…","frontmatter":{"date":"June 07, 2008","path":"/blog/the-terminator-fiction/","title":"The Terminator: Fiction?"}}},{"node":{"id":"b97393f2-4c8b-5974-a4bc-b78a5c7606df","excerpt":"Here's another \"wow\" project - FLARToolKit (FLash Augmented Reality ToolKit)Your webcam, little bit of Papervision, the FLARToolKit, and you're off.It's similar technology to that which powers \"Eye of Judgement\", and is pretty cool.  If you've got a…","frontmatter":{"date":"June 05, 2008","path":"/blog/augmented-reality-with-flash/","title":"Augmented Reality with Flash"}}},{"node":{"id":"878e05c7-9669-52bc-8f1d-094dd03667ed","excerpt":"Ah Facebook. As a rule of thumb you shouldn't really add any more personal information than's nessessary to a website - but people tend to just forget that, especially on social networking sites. And noone really reads the legal & privacy notices…","frontmatter":{"date":"May 30, 2008","path":"/blog/facebook-security/","title":"Facebook security?!"}}},{"node":{"id":"04da137e-46e9-583a-ab8e-fba9fd81b529","excerpt":"Immersive Media, who I gather are also responsible for a lot of the Google Streetview images, have taken the 'interactive panorama' idea a little further than most, and introduced 'Immersive Video'. Sound interesting? Indeed it is. \"360degreeflash…","frontmatter":{"date":"May 27, 2008","path":"/blog/immersive-media-360-flash-video/","title":"Immersive Media : 360° Flash Video"}}},{"node":{"id":"408a1e8c-f72d-57b5-b09d-ae6902660064","excerpt":"FIVe3D is unlike other 3D engines ( such as Papervision or Alternitva3D ) in it's approach.  We're not talking shape primatives here, we're talking extending the basic flash elements ( Sprites, Text, MovieClips ) to include Z-properties.  Looking at…","frontmatter":{"date":"May 15, 2008","path":"/blog/five3d-a-different-approach-to-3d-flash/","title":"FIVe3D - A different approach to 3D Flash"}}},{"node":{"id":"0b17a73b-a9e8-5561-a3a9-a5f6c4df4a8e","excerpt":"We use javascript to load our Flash elements into Webpages - it just makes life so much easier. There's many ways you can go about it, but one is to use inline Javascript to handle function calls to your document.write(); or innerHTML(); functions…","frontmatter":{"date":"May 11, 2008","path":"/blog/inline-javascript-and-the-defer-attribute/","title":"Inline Javascript and the defer attribute"}}},{"node":{"id":"7cc599be-62b9-590e-9ef0-10a8100adaf1","excerpt":"BiteArray.org has a little collection of several ActionScript 3 Classes that would feel right at home in your core libraries.  There's a JPEG encoder, PDF generator, Zip file generator and even a class for gesture recognition, and many more besides…","frontmatter":{"date":"May 09, 2008","path":"/blog/essential-actionscript-3-classes-1/","title":"Essential ActionScript 3 Classes #1"}}},{"node":{"id":"235ea826-2263-597c-8ff6-5f4c625fd444","excerpt":"3D Flash engines seem to be popping up everywhere at the moment.  [Although I wouldn't call that a bad thing] - Each one tends to take a different approach, do a different demo to distinguish themselves.  Take this for example, a very impressive…","frontmatter":{"date":"May 03, 2008","path":"/blog/alternativa3d-more-3d-goodness-from-the-flash-player/","title":"Alternativa3D - More 3D goodness from the Flash Player"}}},{"node":{"id":"9b86636d-4ae5-5e3b-90ec-faf1fb876b99","excerpt":"Madness in a good way, of course. Like all those people who queue outside stores before the sales? That's the good kind of madness. That's the madness I mean. (And I couldn't think of a more interesting Post title, and apparently, provocative Post…","frontmatter":{"date":"May 01, 2008","path":"/blog/open-screen-madness/","title":"Open Screen madness?"}}},{"node":{"id":"b5378ee6-dfe4-5194-b488-e9568a7e7c0d","excerpt":"This is a short little video that demonstrates a quick and easy way of removing unwanted elements from your photos. To do it yourself, you'll need several shots of your target - enough so that any area covered in one photo is uncovered in another…","frontmatter":{"date":"April 26, 2008","path":"/blog/automated-removal-of-non-static-elements-with-photoshop/","title":"Automated removal of non-static elements with Photoshop"}}},{"node":{"id":"4f2a8222-aeb4-5444-aeea-2d6c628f93e5","excerpt":"Ultrashock is one of those sites whose forums I tend to stumble around quite frequently on the 'net - but I've only recently taken a good look at it. The site itself is pretty impressive you know. It's mostly full browser flash, and a few of the…","frontmatter":{"date":"April 24, 2008","path":"/blog/ultrashock-v2/","title":"Ultrashock v2"}}},{"node":{"id":"dc6d1dea-1217-5682-99ad-69ca3b36f6f0","excerpt":"Tickets for Flash on the Beach '08 are now on sale.  I've got mine (thanks, James!)  Go get yours?","frontmatter":{"date":"April 21, 2008","path":"/blog/flash-on-the-beach-08/","title":"Flash on the Beach '08"}}},{"node":{"id":"fb1675b9-5bf5-599c-9587-2dfc450aea90","excerpt":"Just what Adobe AIR is, is an unusual concept. But I think I'm getting the hang of it.Adobe AIR is not...Adobe AIR is not a direct replacement for Adobe Director, and in that respect not a competitor to products like MDM Zinc. Macromedia / Adobe has…","frontmatter":{"date":"April 13, 2008","path":"/blog/adobe-air-is/","title":"Adobe AIR is..."}}},{"node":{"id":"c2a8a11c-c908-5b1e-9254-f65ea79684e2","excerpt":"Well, here's a mercifully easy to solve problem with Adobe AIR.A couple of people pointed out that Internet Explorer was saving my .air download files as .zip format - even going so far as to change the filename extension to .zip. (Firefox is fine…","frontmatter":{"date":"April 11, 2008","path":"/blog/air-files-downloading-as-zips/","title":"AIR files downloading as .zips?"}}},{"node":{"id":"3915c6b5-2da6-50c0-a10a-e17e35d7b87d","excerpt":"Well, despite coming down with a killer headache 1/2 way through the event, I thoroughly enjoyed the London leg of the on AIR tour. All the guys from Adobe and [most of] the 'guest speakers' were really interesting. Toying around with AIR before the…","frontmatter":{"date":"April 11, 2008","path":"/blog/on-air-london-review/","title":"on AIR London / Review"}}},{"node":{"id":"80e219fe-2140-53c0-8404-2b6a3dff3244","excerpt":"Well, here it is, my first Adobe AIR application from Flash.What does it do? Well, it takes an ANSI or Latin1 encoded text file, and spits it out in UTF-8 format. The need is pretty basic, and as is the core code, but it did give me an opportunity to…","frontmatter":{"date":"April 08, 2008","path":"/blog/utf-8-bot-file-encoding-conversion-with-air/","title":"UTF-8 Bot - file encoding conversion with AIR"}}},{"node":{"id":"a1c9361d-df9b-5440-940b-43e73945aa47","excerpt":"I thought i'd do a little bit of serious work with Air - how about an application for converting text file formats? Well ok, it sounds boring, but it's a starting point. I'm not finished yet, but my deadline is pretty harsh (Wednesday, in fact!) so I…","frontmatter":{"date":"April 07, 2008","path":"/blog/playing-with-air/","title":"Playing with Air..."}}},{"node":{"id":"f116fb52-3e91-5199-a2c0-e852f9fa6c2e","excerpt":"The FLVPlayback component that comes with Flash CS3 has been given a bit of a facelift, you know. (Well, the AS3 one has anyway - the older AS2 version is still the same old Flash 8 one).Both versions have support for FullScreen, High-Def video and…","frontmatter":{"date":"April 04, 2008","path":"/blog/exploring-the-flash-cs3-flvplayback-component/","title":"Exploring the Flash CS3 FLVPlayback component"}}},{"node":{"id":"73fd42a5-1131-5955-8e05-b896f5ea09c4","excerpt":"***And a little bit of custom-font magic...**johnny.jpgAlthough I do like writing lovely elegant code I'm also a big fan of 'the cheap hack'! Here's one I used last week to get round the age old problem of dynamic text boxes in Flash not supporting…","frontmatter":{"date":"March 30, 2008","path":"/blog/superscript-and-subscript-with-actionscript/","title":"Superscript and Subscript - with Actionscript*"}}},{"node":{"id":"f4672f2e-c416-5c7e-a204-e2f4e62a4ed7","excerpt":"You know those lovely font embedding options?Wouldn't it be great if you could make your own character sets?As great as the default options are (All, Uppercase, Lowercase, Numerals) the latter 3 combined don't contain all of the visible characters…","frontmatter":{"date":"March 25, 2008","path":"/blog/custom-character-set-embedding-in-flash/","title":"Custom character-set embedding in Flash"}}},{"node":{"id":"5f2063ec-f4bd-5b19-8a89-1624e073c8ce","excerpt":"Upcoming flash player update? Uh oh...Well, I'm all for continually updating and improving products, but in the case of Flash it's a real problem when it interferes with backwards-compatability and certain methods of working. I am of course…","frontmatter":{"date":"March 16, 2008","path":"/blog/flash-player-security-update/","title":"09/04/08 Flash Player security update"}}},{"node":{"id":"2d4675cf-0487-5f0d-97da-20c76c7ebbe2","excerpt":"Here's a funny story. Well, maybe not funny. Or particulary interesting - just informative. Maybe.[logo_sifr2.gifSo I'm using sIFR text on a clients' website, which has always worked before - and the links stop working. There's no real consistancy…","frontmatter":{"date":"March 07, 2008","path":"/blog/sifr-links-not-working/","title":"sIFR links not working?"}}},{"node":{"id":"536322f7-d088-5e6b-822f-07c942676332","excerpt":"Here's a couple of scripts that were linked to in the FlexCoders mailing list, some Actionscript 3.0 classes for easily handling the Google Analytics API (via ExternalInterface). I haven't had a chance to test them yet, but it might be useful to…","frontmatter":{"date":"March 01, 2008","path":"/blog/google-analytics-class-as3/","title":"Google Analytics Class - AS3"}}},{"node":{"id":"330dbca3-1a88-5b5c-8676-b9af6d4bc6ae","excerpt":"Well, a quick Google would find you a plethora of pages, giving you pretty much exactly the same thing - that is, AS2 to AS3 migration guides. A list of function name / class hierachy changes only goes so far, however - nothing seems to deal with the…","frontmatter":{"date":"February 27, 2008","path":"/blog/trouble-migrating-to-actionscript-3/","title":"Trouble migrating to Actionscript 3?"}}},{"node":{"id":"d95d9c8c-ea85-530a-8ccc-0ff042fb2e8d","excerpt":"Did you know you could customize the selection colours of html pages with CSS?  I didn't - until now.  Turns out, there's a CSS3 pseudo-element called ::selection.  Naturally, this isn't yet a technique supported by browsers like Internet Explorer…","frontmatter":{"date":"February 24, 2008","path":"/blog/css-selection-styles/","title":"CSS Selection Styles?"}}},{"node":{"id":"5ae91418-52bd-5374-8008-96d2db704e1d","excerpt":"Well, I know this is a bit behind the official announcement, but the Adobe on AIR tour (that went across the US a little while ago) is soon to begin it's European leg, stopping in 12 European cities.  I'm signed up for it, and should be attending the…","frontmatter":{"date":"February 23, 2008","path":"/blog/adobe-on-air-comes-to-london/","title":"Adobe on AIR comes to London..."}}},{"node":{"id":"ad2e79fc-51da-54f9-9fe4-cce2fbe050d8","excerpt":"Submitted on 02/12/2005, this is pretty much my first attempt at full-on Actionscript programming. When the project started, I was having to look up things like 'functions' on Google to see what all those forums were talking about. This was…","frontmatter":{"date":"February 04, 2008","path":"/blog/i-found-one-of-my-old-uni-projects/","title":"I found one of my old uni projects..."}}},{"node":{"id":"55e5991e-f9ff-5a9c-8247-2c9df72049c4","excerpt":"A very different approach to tagging? Well, comments are closed over on that site, so I thought I'd voice my opinions here. That is after all, what I have this site for. In his post, Ryan is sharing his thoughts on the approach to tagging on Ask E. T…","frontmatter":{"date":"February 03, 2008","path":"/blog/a-different-approach-to-tagging/","title":"A different approach to tagging?"}}},{"node":{"id":"38bc84dd-e755-5c02-88c4-b5948fc13bd7","excerpt":"XSLT is XSL Transformations, and XSL is Xtensible Stylesheet Language. (So says w3schools)XSLT is pretty impressive. With a single stylesheet you can completely reformat XML data into a HTML structure that suits your needs. Even better than that, you…","frontmatter":{"date":"January 30, 2008","path":"/blog/xslt-and-rss-feeds/","title":"XSLT and RSS feeds."}}},{"node":{"id":"bf2e6a32-ed96-596a-ada2-7c76338323ac","excerpt":"I thought it was about time I got into some AJAX, or at least got into making use of some Javascript libraries that work with it. Check out the search feature - pretty snazzy, huh?I based it on the AJAX search results plugin \"Addicted to Live Search…","frontmatter":{"date":"January 28, 2008","path":"/blog/getting-started-with-ajax-prototype/","title":"Getting started with AJAX / Prototype"}}},{"node":{"id":"c8052684-c39c-55c1-ae46-f9fd85fdbfe4","excerpt":"Wow. My previous post, Auto-matic Link Icons is by far the most popular on Psyked. It's even been translated into Russian! Things are constantly evolving, and I thought it only suitable that I should expand upon the original with a few new ideas…","frontmatter":{"date":"January 08, 2008","path":"/blog/automatic-link-icons-v20/","title":"Automatic Link Icons v2.0"}}},{"node":{"id":"fdc7b10e-ac60-596a-a1a3-8921b49c51eb","excerpt":"It's that time of year again, when production schedules relax just enough for the Marketing guys to get a look in, and we get to knock up a nice festive game for our Christmas E-mails. Last year we canibalized an old promotional game - spruced it up…","frontmatter":{"date":"December 17, 2007","path":"/blog/christmas-games-online-downloadable/","title":"Christmas Games – Online & Downloadable"}}},{"node":{"id":"63058237-dfb8-51d7-bf51-c4d8c9802389","excerpt":"So, you have links that open in new windows, and links that open in parent windows. Inconsistant behaviour is the primary usability nightmare, and your standard web browser doesn't give you any feedback on just what is going to happen once you click…","frontmatter":{"date":"December 05, 2007","path":"/blog/identifying-link-targets-with-css/","title":"Identifying link targets with CSS"}}},{"node":{"id":"0a4f1326-6870-55f1-baeb-8b57eddd2f59","excerpt":"From time to time it's fun to give your computer an overhaul. Here's a few simple, and not-so-simple ways rejuvinate your humdrum old Windows machine. And I'm assuming that we're using Windows XP here - not ole' Vista.#1 A New theme!You mightn't like…","frontmatter":{"date":"December 02, 2007","path":"/blog/pimp-my-pc-improving-the-look-feel-and-general-efficiency/","title":"Pimp My PC - Improving the look, feel and general efficiency"}}},{"node":{"id":"d2bd9638-d2c0-5247-a9a6-c9c4b3d2c0a1","excerpt":"Why would you want too?How often is it the case that you're not quite sure where a link is going to take you? Ok, so it's not a major issue for mainstream browsers - after all, that's what the \"Status bar\" is for. But beyond your normal browser…","frontmatter":{"date":"November 27, 2007","path":"/blog/displaying-link-locations-with-css/","title":"Displaying Link locations with CSS"}}},{"node":{"id":"b152996e-4bca-5000-8a57-7606b19b7ba0","excerpt":"There's nothing like a good round of tutorials to help your Monday morning procrastination inspiration. If you haven't already seen them, I'd suggest having a look at the following three Photoshop tutorials;Creating an Old-Collage effect posterUsing…","frontmatter":{"date":"November 26, 2007","path":"/blog/snazzy-photoshop-tutorials-to-check-out/","title":"3 Snazzy Photoshop tutorials to check out…"}}},{"node":{"id":"a61e7fec-1b1c-57e8-a230-884eebc10ec6","excerpt":"IntroductionWeb design enevitably has some hangovers from the early days. The web is, and always has been, really nothing more than a network of documents. Ok so the documents are often cleverly generated on-the-fly by computer systems, but they're…","frontmatter":{"date":"November 25, 2007","path":"/blog/design-trends-tabloid-pages/","title":"Design Trends: Tabloid Pages"}}},{"node":{"id":"1d530b79-9e39-5f90-a916-75e3cc283dfc","excerpt":"Perhaps not as exciting as yesterdays' post, but at least this time I'm showing off my own experiaments! This time, we're looking at sound visualization with ActionScript 3. And playing around with Zinc to get a transparent-desktop application…","frontmatter":{"date":"November 18, 2007","path":"/blog/more-development-peeky-sneaks/","title":"More development peeky-sneaks…"}}},{"node":{"id":"e7d7e2ff-117e-51cb-9196-d1bf5ec3a674","excerpt":"I just had to show off one of Marks' little prototypes.If you're interested in seeing what becomes of it, be sure to send an email to enquiries[at]mmtdigital.co.uk and ask about subscribing to the MMT Digital E-Newsletter.","frontmatter":{"date":"November 17, 2007","path":"/blog/development-sneaky-peek/","title":"Development sneaky-peek"}}},{"node":{"id":"f0cbff4a-8efe-5237-a3c2-d39d53656471","excerpt":"Vector Magic was recently introduced to me by Spreadshirt.  Essentially, it's an online vector tracing tool, kinda like those bundled with packages like the Adobe suite or other design programs.  It relies on Flex, although I can't quite figure out…","frontmatter":{"date":"November 11, 2007","path":"/blog/vector-magic/","title":"Vector Magic"}}},{"node":{"id":"70b0785d-fd9d-5a53-a4ff-79e4f8aa2c8f","excerpt":"This is perhaps an unusual one - and one I haven't seen anyone else make much fuss over, so here goes.Using the standard Version 2 components (Flash MX2004+) I've been trying to link the movement of three components together. \"No biggie\" you'd think…","frontmatter":{"date":"November 04, 2007","path":"/blog/syncronising-scrollpane-components-in-actionscript-2/","title":"Syncronising ScrollPane Components in ActionScript 2."}}},{"node":{"id":"5558849c-0100-54d2-865c-0bd392222eb8","excerpt":"Widgets, scripts and all that fashionable stuff is great - you sign up to the service and you can start pasting their code into your pages. Voila! you have a new stat counter - or popularity counter, whatever. They're great, but the practice of…","frontmatter":{"date":"October 28, 2007","path":"/blog/pseudo-ajax-loading-with-css/","title":"Pseudo-AJAX loading with CSS"}}},{"node":{"id":"d67adb79-7144-58cb-8dcc-d1b9258aeaa4","excerpt":"Here's a neat little site - ajaxload.  There's nothing better than letting your user know when they're waiting for something, and although a simple animation can't tell them the exact progress, or how much longer they'll have to wait - it's often the…","frontmatter":{"date":"October 21, 2007","path":"/blog/fast-and-fresh-loading-graphics-with-ajaxloadinfo/","title":"Fast and fresh loading graphics with ajaxload.info"}}},{"node":{"id":"99108b45-df5b-537e-bc37-635cf03706ca","excerpt":"Here's a wierd one. Let's say you have a flash navigation - one of those old DHTML style drop-down ones, but done in flash and layered over the top of your page content. You can stick the wmode to transparent and have a transparent background for…","frontmatter":{"date":"October 20, 2007","path":"/blog/externalinterface-not-working-in-firefox/","title":"ExternalInterface not working in Firefox?"}}},{"node":{"id":"75ee1bbb-4d90-583d-bc28-a21c4aaef039","excerpt":"XHTML is the attempt to purify the traditional mishmash of HTML standards, separating content from appearance, and to create a more elegant solution, for a more civilized age.That's great in theory - but unless you're armed with a plethora of cross…","frontmatter":{"date":"October 15, 2007","path":"/blog/xhtml-hyperlinks-and-separating-content-from-style/","title":"XHTML, Hyperlinks and separating content from style."}}},{"node":{"id":"1690edc5-22ff-52a7-8e9b-78b9c09c5e5f","excerpt":"Psdtuts (Photoshop-document tutorials) hit the scene a little while ago on digg, and I've had it on my RSS subscriptions ever since. Off like a dynamo with the Photoshop tutorials, I'd certainly keep an eye on it - looks to have potential to be…","frontmatter":{"date":"October 08, 2007","path":"/blog/mastering-photoshop-with-psdtutscom/","title":"Mastering Photoshop with psdtuts.com"}}},{"node":{"id":"b70045f0-63a7-5b40-9060-f0dd6007bc1f","excerpt":"What is Fiddler?From the Fiddler website:Fiddler is a Web Debugging Proxy which logs all HTTP(S) traffic between your computer and the Internet.Simple really. Introduced to me by Chris Preece, this is a Microsoft-made free debugging tool which shows…","frontmatter":{"date":"October 07, 2007","path":"/blog/debugging-flash-movies-with-fiddler-2/","title":"Debugging Flash Movies with Fiddler 2"}}},{"node":{"id":"6b742595-8d7b-5ec0-9194-1152e835b06f","excerpt":"Ever used getURL(); for loading new pages in Flash? That's how you load a new page. Obvious, huh?In 97% of situations it works fine. The other 3% it doesn't* I've had a rough ride with getURL unexplicably not functioning. Turns out that it works if…","frontmatter":{"date":"October 01, 2007","path":"/blog/geturl-doesnt-work/","title":"\"getURL doesn't work!\""}}},{"node":{"id":"031ad996-0a7c-5aef-bfdc-9dcb822b940e","excerpt":"This post all stems from a project I've been working on very recently, making a drop-down menu in flash, that sits in a HTML page. What we're talking in relation to here is, getting flash to execute JavaScript DOM functions.Now, there are couple of…","frontmatter":{"date":"September 23, 2007","path":"/blog/actionscript-geturl-vs-externalinterface-when-why/","title":"ActionScript: getURL vs. ExternalInterface - When & Why"}}},{"node":{"id":"0009e943-114c-52f4-b188-d6d04de283ce","excerpt":"This ActionScript 2.0 Class enables you to easily adjust the colour saturation of any Flash MovieClip during runtime. It requires Flash Player version 8 or above, and uses the ColourTransformationMatrix and some clever jiggery-pokery to adjust the…","frontmatter":{"date":"September 04, 2007","path":"/blog/movieclip-saturation-class-actionscript-20/","title":"MovieClip Saturation Class - ActionScript 2"}}},{"node":{"id":"c621fccf-f75f-58b5-b2bb-ed11f6ec24f6","excerpt":"or, When is your CMS not a CMS?Computer-orientated terminology tends to get thrown around like buzzwords, it seems. Not only by people who don't really know what they're talking about - but also by those that should. And, like buzzwords, they convey…","frontmatter":{"date":"August 30, 2007","path":"/blog/missapplication-of-terminology/","title":"Missapplication of Terminology"}}},{"node":{"id":"3fcdf48f-3471-57ac-88c4-bf6f4de8f218","excerpt":"If you're sitting around, wondering what would make your Wordpress just that little bit more awesome, be sure to check out the Wordpress Plugins section of alexking.org.  What can I say?  The plugins are all geared towards adding that little extra…","frontmatter":{"date":"August 27, 2007","path":"/blog/alexkingorg-cool-wordpress-plugins/","title":"Alexking.org - Cool Wordpress Plugins"}}},{"node":{"id":"5418881b-1872-5d9f-bab4-a992bf469db6","excerpt":"Adobe has recently released the Beta of its' next major update to the Flash Player - on Abobe Labs - and this time with HD Video support. (Amongst other general improvements) From a few other reports I've come across, the final version is expected in…","frontmatter":{"date":"August 23, 2007","path":"/blog/flash-player-set-to-include-hd-video/","title":"Flash Player - set to include HD Video"}}},{"node":{"id":"57f25466-c1c0-5704-9996-6a36665d29e4","excerpt":"Right up-top there in the usability stakes is the fact that you should always give your visitors what they want.  That's tough, especially when the page they end up with is \"Error 404\".  I'm not going to go off on a rant about what you can do, but…","frontmatter":{"date":"August 19, 2007","path":"/blog/404-pages/","title":"404 pages"}}},{"node":{"id":"605cdab5-5e0d-58f0-8c46-4ac4d12ff4ff","excerpt":"From côdeazur:FZipFZip is an Actionscript 3 class library to load standard ZIP archives and extract/decompress contained files.FZip parses ZIP archives progressively, allowing access to contained files while the archive is loading. http://codeazur…","frontmatter":{"date":"August 09, 2007","path":"/blog/actionscript-30-lets-you-work-with-zip-files/","title":"ActionScript 3.0 lets you work with ZIP files?"}}},{"node":{"id":"bf35a048-fead-5783-af9e-7e52b2b54da9","excerpt":"Ok, so I didn't get my ass into gear and enter the competition - but others did, and their designs are now available to view online. The results are announced tomorrow (being Monday) Check out the competition website.I've had a mosey through the…","frontmatter":{"date":"August 05, 2007","path":"/blog/sandbox-design-competition-results-tomorrow/","title":"Sandbox Design competition (results tomorrow)"}}},{"node":{"id":"8e3d2deb-644c-59df-a322-1431807ad50c","excerpt":"I've been a bit slack on the External links side of things recently - but Deziner Folio really deserves a mention. It's run by two guys - Navdeep and Navin. Deziner Folio is slick, with a nice design, spiffy transitions and, well, generally good…","frontmatter":{"date":"August 05, 2007","path":"/blog/on-deziner-folio/","title":"on Deziner Folio..."}}},{"node":{"id":"e65c940c-63b2-5002-a344-6069fadb7f44","excerpt":"Well, it's gone Friday, so where's my new AIR app? Unfortunately, I can't give it you yet - although its nearly ready to be unleashed, I can't show it until the next issue of the E-Newsletter is sent out. (That's Marketing for you.) So you'll have to…","frontmatter":{"date":"August 04, 2007","path":"/blog/exploring-air-the-roundup/","title":"Exploring .air - the roundup."}}},{"node":{"id":"5b7a817a-0244-5e44-b6d0-0cd0c9c15304","excerpt":"\"James!\" they say, \"you've been dying to play with Flex and Air. Make us an application to accompany our E-Newsletter!\" How could I refuse?\"You have until friday.\"So that's what I've been doing.I have unfortunately, no previous experience with Flex…","frontmatter":{"date":"August 01, 2007","path":"/blog/one-week-get-to-grips-with-adobe-air/","title":"One week get to grips with Adobe AIR..."}}},{"node":{"id":"295f5d4b-773f-5ec2-9a66-84bc99f4da25","excerpt":"I just upgraded to CS3 (finally!), yet I'm still dissappointed by the lack of support for Icon files. Especially now that favicons are so in vogue now. Fear not though, because Open-source plugins are to the rescue!Very easily, you can now save out…","frontmatter":{"date":"July 21, 2007","path":"/blog/creating-an-icon-with-photoshop/","title":"Creating an Icon with Photoshop"}}},{"node":{"id":"2f989436-a997-5fe2-8723-f64b40aae939","excerpt":"DONTCLICK.IT and pr0jects are a couple of outstanding Flash-based sites I've come across this month.[Don't Click.it, as the name may suggest, is all about not clicking. Trying to break the habits, and go with purely gesture related interaction. It's…","frontmatter":{"date":"July 20, 2007","path":"/blog/smashing-flash-websites/","title":"2 Smashing Flash Websites..."}}},{"node":{"id":"fae2a050-a420-58f1-9a49-aee2f023c691","excerpt":"This is something that I've had a wee bit of an issue with recently, but I thought I'd mention it now. Why not, eh?For the uninitiated, alt tags are alternative text, a label if you will, that is used to explain the content of an image, when images…","frontmatter":{"date":"July 18, 2007","path":"/blog/little-html-mysteries-alt-vs-title/","title":"Little HTML mysteries...  alt vs. title"}}},{"node":{"id":"edc8f11c-34ce-509e-8333-eb8cbd588041","excerpt":"CSS 2.1 has many new wonderful capabilities, and I'm going to show you one of my latest tricks I've picked up - automatic link icons.First, a look at the end result :-Now, you may have seen similar things on a few websites already, wikipedia…","frontmatter":{"date":"July 10, 2007","path":"/blog/auto-matic-link-icons/","title":"Auto-matic Link Icons"}}},{"node":{"id":"2932382f-f4f9-51f7-a5b9-7c3626da6687","excerpt":"Free fonts, Free Vectors indeed.Where to go for free fonts? Urbanfonts and / or Betterfonts.Where to go for free Vector Art? Vecteezy. Free Brushes (for Photoshop / Illustrator, you know) Brusheezy.urbanfontscom.jpg betterfontscom.jpg [","frontmatter":{"date":"June 30, 2007","path":"/blog/free-fonts-free-vectors/","title":"Free Fonts, Free Vectors"}}},{"node":{"id":"a358afc8-6a35-5006-a081-d7941e6cd73d","excerpt":"Much like the Spartan king from that movie 300, Apollo has obviously spent its time in the alpha version wilderness, and has returned to take on its new name. All praise \"AIR\". (Adobe Integrated Runtime)Seriously though, I'm not sure that it returned…","frontmatter":{"date":"June 26, 2007","path":"/blog/apollo-takes-to-the-air/","title":"Apollo takes to the .air"}}},{"node":{"id":"e60b864f-9698-5e42-9316-51cc3633a5b4","excerpt":"I'm afraid I'm only commenting on hearsay here, not actually firsthand experience. Because we still don't have Adobe Studio CS3 at work. Yes I know, a professional \"New Media\" agency doesn't have the latest and greatest software... shocking.But…","frontmatter":{"date":"June 20, 2007","path":"/blog/adobe-flash-cs3-off-to-a-worrying-start/","title":"Adobe Flash CS3 - off to a worrying start?"}}},{"node":{"id":"97bfbc15-e4ea-597e-9f8a-3b5cab8dc23f","excerpt":"Another useful link, this time for Optimizing & Formatting CSS files.The CSS Formatter / Optimizer is an online form, that can format your CSS in a variety of ways. Just copy & paste, select your options, and the form will chuck your formatted CSS…","frontmatter":{"date":"June 09, 2007","path":"/blog/optimizing-your-css-online/","title":"Optimizing your CSS Online"}}},{"node":{"id":"15301f98-5b54-517c-8666-8f2d586b3cd0","excerpt":"The Sandbox Designs Competition for WordPressApparently, there hasn't been one like it since 2004, but now Scott of plaintxt.org is holding a \"Sandbox design competition\" (Sandbox being the name of the Wordpress theme that it'll all be based around…","frontmatter":{"date":"June 07, 2007","path":"/blog/wordpress-design-competition/","title":"Wordpress design competition..."}}},{"node":{"id":"723f93cb-7e1d-526b-b974-4d9722ad2fd8","excerpt":"Really easy, in fact. www.websitescreenshots.com has a downloadable program by Nathan Moinvaziri which is simply awesome. It ties into Internet Explorer, and uses it to capture a full or part screenshot of any website. It has all the native features…","frontmatter":{"date":"June 05, 2007","path":"/blog/website-screenshots-made-easy/","title":"Website screenshots made easy."}}},{"node":{"id":"4a07e62a-44ca-5cb4-bc17-494e12005cd8","excerpt":"Apparently so. For one of our recent projects, we've been plagued with reports of a 'Black screen of Death' - where our program would seize up and keel over whilst using our interactive drawing tools. This seemed to happen on approximately 3% of our…","frontmatter":{"date":"June 05, 2007","path":"/blog/flash-16bit-colour-blendmodes-and-cacheasbitmap-a-recipie-for-disaster/","title":"Flash, 16bit colour, blendModes and cacheAsBitmap.  A recipie for disaster?"}}},{"node":{"id":"2747c5ca-9e3a-5eea-bd93-d6adca535716","excerpt":"Following up on yesterdays' post, there's perhaps an even better way to find yourself some free stock imagery. Everystockphoto is a search engine that pulls its images from a range of online imagebanks, all free of course. Amongst them are sites like…","frontmatter":{"date":"June 04, 2007","path":"/blog/everystockphoto/","title":"EveryStockPhoto"}}},{"node":{"id":"b0a69119-b903-51c5-ab5e-23b3c399604f","excerpt":"Free stock photos? Easy. Stock.xchng (www.sxc.hu) is a lovely little website that offers you just that. There's a little bit of liscensing on some images, and you have to register (for free, however) to view the full-size images, but that's all. It's…","frontmatter":{"date":"June 03, 2007","path":"/blog/stock-exchange/","title":"Stock Exchange"}}},{"node":{"id":"a6db37d5-8a82-5431-ad4f-01c8bc680f90","excerpt":"Validation. It's an important element to production of those pesky websites. Probably more important and more awkward than it should be. No, scratch that, deffinately more awkward than it should be. But that's not all there is to making a decent…","frontmatter":{"date":"June 01, 2007","path":"/blog/more-than-just-validation/","title":"More than just validation..."}}},{"node":{"id":"1cb747f7-51b2-512d-8e64-e06348b2f569","excerpt":"Or, more specifically, how I decided to reign in mine.Hyperlinks are the fundimental element of the World Wide Web. They've been in it from the start, and without them, well, it wouldn't be a web, would it?Search engines are rather keen on links, and…","frontmatter":{"date":"June 01, 2007","path":"/blog/reigning-in-your-linkspam/","title":"Reigning in your linkspam"}}},{"node":{"id":"bf3476e5-a474-5d15-a0b4-8773b42223b5","excerpt":"Times move fast on the web. RSS has been mainstream for quite a while. So long, in fact, that RSS readers are now built into the two major windows browsers, Internet Explorer 7 and Firefox 2. It's been inbuilt for longer on the Mac, I hear. So, in…","frontmatter":{"date":"May 28, 2007","path":"/blog/rss-bling-or-no-bling/","title":"RSS.  Bling or no Bling?"}}},{"node":{"id":"ed863186-579e-5ddf-800d-d5b15193802c","excerpt":"Working with a lot of Flash video (.flv) I'm acutely aware of the lack in decent, standalone FLV Players. Sure, there's a few out there, but not many that are decent. I have used FLV Player 1.3.3, but it's not up to much when you're trying to preview…","frontmatter":{"date":"May 28, 2007","path":"/blog/flash-video-the-solution/","title":"Flash Video - the Solution?"}}},{"node":{"id":"7dcea73c-965c-59bd-8684-efa7cfffe540","excerpt":"I noticed today that Kuler Desktop has arrived. Kuler, as I've mentioned before, is an awesome tool, and one which I first found out about through my research into Apollo. Kuler was always designed to be one of the first Apollo aps, a community…","frontmatter":{"date":"May 28, 2007","path":"/blog/kuler-desktop-released/","title":"Kuler Desktop released!"}}},{"node":{"id":"0fa54593-7795-5ad5-8478-72d2f40e1095","excerpt":"It's so hard to find useful resources for Icons on the web. Especially product icons. If you've ever tried putting together a design, one that requires product attribution, you'll know what I mean. Far as I'm concerned, companies should start…","frontmatter":{"date":"May 18, 2007","path":"/blog/adobe-cs3-icons/","title":"Adobe CS3 Icons"}}},{"node":{"id":"9aeac5cd-c2c3-5d49-a365-732f5c1754dd","excerpt":"Print Designers have it easy, you know. They get things like Pantone Books, and well, things like that. Time to even the score? I think so, and obviously so does Adobe.Until recently, I'd touted ColorJack as the best place to gen-up on colour theory…","frontmatter":{"date":"May 15, 2007","path":"/blog/web-designers-secret-weapon-1-kuler/","title":"A Web Designers' Secret Weapon #1 : Kuler"}}},{"node":{"id":"511d12ad-da87-569a-a8a0-8649b09c6a51","excerpt":"There we have it, Adobe announced today the release of Flex to the Open Source community. While this sounds like a bit of a radical step, I mean, making a $750 programme free? It actually makes a weird sort of sense. Lets step into the press release…","frontmatter":{"date":"April 26, 2007","path":"/blog/flex-goes-open-source-what-does-this-mean/","title":"Flex goes Open-Source, what does this mean?"}}},{"node":{"id":"1bdac183-72b4-5f99-abfa-e7679be4f60d","excerpt":"This is a simple little segment of code that i find very useful to work my way through flash files. It basically lists all the properties (which includes direct children) of the target movieclip. Here's a few implimentations...(Set n beforehand with…","frontmatter":{"date":"February 28, 2007","path":"/blog/actionscript-debugging/","title":"ActionScript Debugging"}}}]}},"pageContext":{"isCreatedByStatefulCreatePages":true}}