{"data":{"site":{"siteMetadata":{"title":"James Ford","description":"James Ford's Portfolio"}},"allMarkdownRemark":{"edges":[{"node":{"id":"b1ef9f53-d2c5-5a95-9292-0219455d2982","excerpt":"...","html":"<p>...</p>","frontmatter":{"date":null,"path":"speaking/delivering-js-at-scale","title":"Delivering JS at Scale"}}},{"node":{"id":"0d38624c-4a52-5487-971f-3836ba07b313","excerpt":"Think want to use TypeScript, but for one reason or another you’re not ready to make the leap into using .ts files? What is TypeScript anyway? How could it help us make better code or change our development experience? How exactly is it different…","html":"<p>Think want to use TypeScript, but for one reason or another you’re not ready to make the leap into using .ts files? What is TypeScript anyway? How could it help us make better code or change our development experience? How exactly is it different from normal Javascript, and is there a middle ground to be had with TypeScript that never leaves the safety of Javascript? All of this will hopefully be answered!</p>","frontmatter":{"date":null,"path":"speaking/guerilla-typescript","title":"Guerilla TypeScript"}}},{"node":{"id":"79e11942-b30c-5dbd-b9ae-2a108953ead8","excerpt":"Open Source is a great idea for benefitting from the publicly available shared efforts of others, but what about sharing private code within your organisation? We call this \"Inner Source\", and we have a strategy and mentality (our \"Ecosystem\") that…","html":"<p>Open Source is a great idea for benefitting from the publicly available shared efforts of others, but what about sharing private code within your organisation? We call this \"Inner Source\", and we have a strategy and mentality (our \"Ecosystem\") that we've been refining over the past few years to make it work and have Inner Source deliver benefits to Compare the Market.</p>","frontmatter":{"date":null,"path":"speaking/inner-source-ecosystems","title":"Inner Source Ecosystems"}}},{"node":{"id":"c14181d8-1184-5fef-b7ea-746fe13f2ecf","excerpt":"Software development is challenging, and cognitive overload is an enemy of productivity. We software developers probably spend more time in our IDE than we'd like to admit. We have the skills and ability to make our own lives better through…","html":"<p>Software development is challenging, and cognitive overload is an enemy of productivity. We [software developers] probably spend more time in our IDE than we'd like to admit. We have the skills and ability to make our own lives better through technology, so why aren't we spending more time making our tools work better for us? In this session I'll talk about some of the ways we're making our own lives better through better tooling.</p>","frontmatter":{"date":null,"path":"speaking/make-your-tools-work","title":"Make Your Tools Work"}}}]}},"pageContext":{"isCreatedByStatefulCreatePages":true}}