{"data":{"site":{"siteMetadata":{"title":"Psyked: James' Web Development website","author":"James Ford"}},"markdownRemark":{"id":"3184e1bb-24e1-55a7-abea-fdd7982ee9b2","html":"<h3>or, When is your CMS not a CMS?</h3>\n<p>Computer-orientated terminology tends to get thrown around like buzzwords, it seems. Not only by people who don't really know what they're talking about - but also by those that <em>should</em>. And, like buzzwords, they convey an idea - not a technical specification. If you haven't heard of a CMS or a CDP however, you might be left in the dark.</p>\n<h3>but Buzzwords are cool - they're easy <em>and</em> indeterminate.</h3>\n<p>Sure, saying 'CMS' or 'Content Management System' is easier than describing what you mean all the time - but suppose both parties have completely different ideas of what to expect from a 'Content Management System'. After all, what does your 'Content Management System' do? Does it manage your content for you - or help you manage your content? Does it even do that? Is it just a facilitator for creating content? Drawing up lengthy technical specifications may help, but throw a client-who-uses-misunderstood-buzzwords into the mix and you're in for a bumpy ride. Chances are you'll both assume different functionality.</p>\n<h3>So?</h3>\n<p>So, imagine you have what's called a 'Content Management System' - what should it do? IMO, the humble <strong>Dreamweaver</strong> is a great example of a Content Management System. You can manage files and folders to your hearts' content.</p>\n<p>By keeping an internal database of linked files and folders, Dreamweaver does the tiresome work for you - updating links and pathnames. <strong>Microsoft Office Sharepoint Server (MOSS)</strong> is also very good at this - once pages are linked, you can move, rename and edit them safe in the knowledge that the server <em>knows</em> where the files are. That's what I'd call a Content Management System.</p>\n<p>Conversely however, a search for a Content Management System on google will turn up hundreds of systems - and yet none will offer this kind of functionality. These are the <strong>WordPress</strong> kin - systems that facilitate the creation, modification of files, and day-to-day tasks of running websites. Now, if that doesn't sound like management, I don't know what does. But how can these completely different ideas both come under the same terminology umbrella?</p>\n<p>In short, I'm not sure.</p>\n<p>Broken down into the component parts, terms are usually so ambiguous they need further expansion. That then becomes the point at which you wish you'd never uttered 'CMS', and start trying to come up with a better description. Trouble is, if you use your new, improved, terms - people start giving you blank looks and then the bitter cycle rolls on.</p>\n<h3>What's the real issue?</h3>\n<p>Why does CMS bug me so much? Firstly, [MMT Digitals'] primary website delivery software is branded 'Rearview ECMS'. <a href=\"http://www.mmtdigital.co.uk/RVE83ccb8f256114809ae39c32676211138,,.aspx\" title=\"Open link in a new window\"><em>Rearview Enterprise Content Management System</em></a>. Now, to give credit where credits' due, it's not half bad - you can do all the day-to-day management within the system - but move files, folders or pages around, and kiss your links goodbye - as is the case with so many other similar systems.</p>\n<p>Perhaps these systems should be called 'Content Delivery Platforms' or 'Content Creation Systems' - that is, after all, what they do. <em>You</em> still have to go and fix links <em>yourself</em>. Or maybe they do deserve their titles, and it's the others' that need changing. Something like 'Server Management Software' - no wait, that anagrams' already taken. How about 'Resource Interface System'?</p>\n<p>Edit [31/08/2007]<br>\nActually, that's not so much the issue as is: What if someone expects you to work with the <em>wrong sort</em> of Content Management System? You can sell the idea of a CMS to your client, but then your client could go around and buy <a href=\"http://office.microsoft.com/en-gb/sharepointserver/HA101656531033.aspx\">Microsoft SharePoint Server</a> and expect you to develop a normal website in it.</p>","frontmatter":{"title":"Missapplication of Terminology","date":"August 30, 2007","tags":["terminology","work"],"url":null,"image":null,"description":null}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"prev":{"frontmatter":{"path":"/blog/alexkingorg-cool-wordpress-plugins/","tags":["wordpress-plugins"],"title":"Alexking.org - Cool Wordpress Plugins","date":"2007-08-27T09:41:06.000Z","description":null,"image":null}},"next":{"frontmatter":{"path":"/blog/movieclip-saturation-class-actionscript-20/","tags":["actionscript","flash","resources"],"title":"MovieClip Saturation Class - ActionScript 2","date":"2007-09-04T22:19:37.000Z","description":null,"image":null}}}}