{"data":{"site":{"siteMetadata":{"title":"James Ford","author":"James Ford"}},"markdownRemark":{"id":"e65c940c-63b2-5002-a344-6069fadb7f44","html":"<p>Well, it's gone Friday, so where's my new AIR app? Unfortunately, I can't give it you yet - although its nearly ready to be unleashed, I can't show it until the next issue of the E-Newsletter is sent out. <em>(That's Marketing for you.)</em> So you'll have to hang on for a few weeks yet.</p>\n<p>Nevermind, eh? I certainly learnt a lot playing with Flex builder / Air / AS3, and here's hoping that I'll have some spare time to do a few articles on what I've learnt - pitfalls, theory, code snippets, that kind of thing.</p>\n<p>One thing I realised is that your intrinsic knowledge of Flash and it's specialised coding methods mean very little working in Flex, but that certainly doesn't mean it's bad - flash programming is probably a bit of a niché market in how it's done and works, and I get the impression that the Flex approach is a lot more mainstream theory-wise, so I'm prepared to put the effort into learning to code properly.</p>\n<p>I perhaps should have put more effort into recording how I got on over the week, but that's hindsight for you. Here's a brief overview of what I got up too, generally just to prove that the longer you work on something, the more progress you make, and the faster you make it.</p>\n<p><strong>Day 01 -</strong></p>\n<p><em>Starting</em> - Getting to grips with the Flex interface - ripping off some existing examples from the 'net - I got a simple Panel / Accordian combo to read in a hardcoded URL feed.</p>\n<p><strong>Day 02 -</strong></p>\n<p><em>Reworking</em> - Experimenting with the Flex components and rearranging our example page to explore how it all fits together. Separated the project into an MXML Application and an MXML Component, and then loaded multiple instances of the two.</p>\n<p><strong>Day 03 -</strong></p>\n<p><em>Dynamism</em> - Added ability to add URLs at runtime, and used the Air Filesystem to load and save settings files. Explored Stylesheet skinning. Massive headaches getting to grips with the E4X XML format. Massive headaches working with the mx:Repeater tag and the general theories behind data-binding.</p>\n<p><strong>Day 04 -</strong></p>\n<p><em>Eppiphany</em> - Added ability to delete URL feeds - Figured out fullscreen transparency, window settings and animation effects. Lots of cursing the apparent lack of dynamic object properties.</p>\n<p><strong>Day 05 -</strong></p>\n<p><em>Completion?</em> - 9Scale graphics and semitransparent skins. Movable windows and saving postion settings. Refresh features and better animations. RSS feed search with JavaScript integration and HTML DOM exploration. Publish settings.</p>","frontmatter":{"title":"Exploring .air - the roundup.","date":"August 04, 2007","tags":["flex","actionscript","air"],"url":null,"image":null,"description":null}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"prev":{"frontmatter":{"path":"/blog/one-week-get-to-grips-with-adobe-air/","tags":["flex","actionscript","air"],"title":"One week get to grips with Adobe AIR...","date":"2007-08-01T20:32:30.000Z","description":null,"image":null}},"next":{"frontmatter":{"path":"/blog/on-deziner-folio/","tags":["external-links","photoshop-resources","wordpress-themes"],"title":"on Deziner Folio...","date":"2007-08-05T21:31:09.000Z","description":null,"image":null}}}}